{"title": "Tired of mediocre outsourcing? Get it right the first time with Valerian (Sponsor)", "link": "https://www.valeriantechnology.com/?utm_source=TLDR&amp;utm_medium=email&amp;utm_id=01", "description": "Your engineers are brilliant, but even the best teams need expert support sometimes to accelerate growth or tackle complex projects. Whether it's ", "tag": [], "date": "2024-08-13"}
{"title": "SpaceX announces first human mission to ever fly over the planet's poles (4 minute read)", "link": "https://arstechnica.com/space/2024/08/spacex-announces-first-human-mission-to-ever-fly-over-the-planets-poles/?utm_source=tldrnewsletter", "description": "SpaceX plans to perform the first-ever human space flight over the Earth's poles before the end of this year. The Fram2 mission crew will comprise a Chinese-born cryptocurrency entrepreneur, a polar explorer, a roboticist, and a filmmaker. They will fly aboard Crew Dragon Endurance, which will be fitted with a cupola for both photography and filming. This will be SpaceX's third free-flying mission aboard Crew Dragon.", "tag": [], "date": "2024-08-13"}
{"title": "What to expect from Google's Pixel 9 event (10 minute read)", "link": "https://www.theverge.com/2024/7/31/24208625/google-pixel-hardware-event-august-2024-leaks?utm_source=tldrnewsletter", "description": "Google's Pixel hardware event is scheduled for today. The company has already confirmed it will be launching the Pixel 9 and the Pixel 9 Pro Fold at the event. There may be other announcements, such as a smaller Pro option, AI features, the Pixel Buds Pro 2, a Pixel Watch 3, and more. This article summarizes the rumors for all the things Google may present at the event.", "tag": [], "date": "2024-08-13"}
{"title": "Scientists Say They've Figured Out How to Regenerate Knee Cartilage (2 minute read)", "link": "https://futurism.com/neoscope/scientists-regenerate-knee-cartilage?utm_source=tldrnewsletter", "description": "Scientists at Northwestern University have invented a goo that could open the door to regenerating human knee cartilage. The goo mimics the chemical structure of cartilage. Animal subjects who had their joints treated with the biomaterial grew new cartilage within six months. If the goo works in humans, it could benefit people who need knee replacement surgeries, athletes who experience ACL tears, and people who suffer from degenerative diseases like arthritis.", "tag": [], "date": "2024-08-13"}
{"title": "It took my savings and 14 years — but I'm about to beat arthritis (8 minute read)", "link": "https://www.thetimes.com/uk/science/article/i-lost-my-job-so-spent-14-years-searching-for-osteoarthritis-cure-d6d69wwxz?utm_source=tldrnewsletter", "description": "Simon Westbrook started a biotech company with his wife Dominique after they were made redundant by Pfizer in 2011. Their mission was to develop a game-changing drug to treat osteoarthritis. 14 years after starting their mission, the effectiveness of their company's treatment has exceeded all expectations. The treatment, which restores protective processes to diseased joints and enables the regeneration of affected tissues, can be delivered via a once-a-month injection. This article tells the story of how the drug was developed.", "tag": [], "date": "2024-08-13"}
{"title": "GIL Become Optional in Python 3.13 (4 minute read)", "link": "https://geekpython.in/gil-become-optional-in-python?utm_source=tldrnewsletter", "description": "Global Interpreter Lock (GIL) can be disabled in Python version 3.13. GIL is a mechanism used by the C Python interpreter to ensure that only one thread executes the Python bytecode at a time. Free-threaded mode, which disables GIL, is currently experimental. Disabling GIL makes a massive difference in the performance of multithreaded tasks.", "tag": [], "date": "2024-08-13"}
{"title": "Go is my hammer, and everything is a nail (5 minute read)", "link": "https://www.maragu.dev/blog/go-is-my-hammer-and-everything-is-a-nail?utm_source=tldrnewsletter", "description": "Go can do basically anything. It's simple, easy to read, and consistent. Using only Go means less context switching and leads to a deeper understanding of the language. There are basically an infinite number of projects out there, so there's still plenty to build even if only knowing one language was a restriction.", "tag": [], "date": "2024-08-13"}
{"title": "American workers are stuck in place because everyone is too afraid of a recession to quit (5 minute read)", "link": "https://boredbat.com/american-workers-are-stuck-in-place-because-everyone-is-too-afraid-of-a-recession-to-quit/#google_vignette?utm_source=tldrnewsletter", "description": "The stagnation in hiring has resulted in a rise of 'stuck' workers who want to quit their jobs but are staying put due to a fear of a potential recession. Americans are quitting their jobs at the slowest pace since the pandemic, despite job satisfaction falling. Job market forecasters say the slowdown in hiring will likely continue.", "tag": [], "date": "2024-08-13"}
{"title": "Replika CEO Eugenia Kuyda says it's okay if we end up marrying AI chatbots (56 minute read)", "link": "https://www.theverge.com/24216748/replika-ceo-eugenia-kuyda-ai-companion-chatbots-dating-friendship-decoder-podcast-interview?utm_source=tldrnewsletter", "description": "Replika offers customizable AI-powered avatars for users to interact with. Users can talk to these avatars through a chat interface, through video calls, or in virtual and augmented reality. This article contains an interview with Replika founder and CEO Eugenia Kuyda, where she discusses how AI tech makes companions possible and what the limits of current models are. Kuyda says the company's goal is not to replace real-life humans, but instead create an entirely new relationship category - a virtual being that can be used for whatever purposes users might need.", "tag": [], "date": "2024-08-13"}
{"title": "TikTok comes for messaging apps with the addition of group chats (2 minute read)", "link": "https://techcrunch.com/2024/08/12/tiktok-comes-for-messaging-apps-with-the-addition-of-group-chats/?utm_source=tldrnewsletter", "description": "TikTok users can now create group chats with up to 32 people.", "tag": [], "date": "2024-08-13"}
{"title": "Apple says Patreon must switch to its billing system or risk removal from App Store (3 minute read)", "link": "https://techcrunch.com/2024/08/12/apple-says-patreon-must-switch-to-its-billing-system-or-risk-removal-from-app-store/?utm_source=tldrnewsletter", "description": "Patreon will move all creators to Apple's iOS in-app purchase system by November 2025.", "tag": [], "date": "2024-08-13"}
{"title": "The cheapest Tesla Cybertruck is $99,990; promised $60K model canceled (2 minute read)", "link": "https://arstechnica.com/cars/2024/08/the-cheapest-tesla-cybertruck-is-99990-promised-60k-model-canceled/?utm_source=tldrnewsletter", "description": "Tesla's Cybertruck has been outselling Ford's F-150 Lightning despite Lightnings being available with price tags $20,000-$30,000 less.", "tag": [], "date": "2024-08-13"}
{"title": "CrowdStrike Exec Shows Up to Accept 'Most Epic Fail' Award in Person (2 minute read)", "link": "https://www.pcmag.com/news/crowdstrike-exec-shows-up-to-accept-most-epic-fail-award-in-person?utm_source=tldrnewsletter", "description": "CrowdStrike President Michael Sentonas said it was important that he accept the award in person so that CrowdStrike could 'own' its mistakes.", "tag": [], "date": "2024-08-13"}
{"title": "OneSchema: a CSV importer you can implement in minutes (Sponsor)", "link": "https://www.oneschema.co/?utm_source=newsletter&amp;utm_medium=tldr&amp;utm_campaign=13089718", "description": "Companies like Ramp, Toast, Scale AI, and Vanta trust OneSchema to provide a delightfully guided spreadsheet import experience for their customers. ", "tag": [], "date": "2024-08-13"}
{"title": "History of HTTPS Usage (20 minute read)", "link": "https://www.jefftk.com/p/history-of-https-usage?utm_source=tldrnewsletter", "description": "Netscape built SSL, a protocol for creating secure channels between clients and servers that can be run over HTTP: combining HTTP and SSL resulted in HTTPS.", "tag": [], "date": "2024-08-13"}
{"title": "A controversial experiment to artificially cool Earth was canceled — what we know about why (4 minute read)", "link": "https://www.theverge.com/2024/8/12/24216232/harvard-solar-geoengineering-policy-analysis-science?utm_source=tldrnewsletter", "description": "Harvard researchers canceled plans to send sunlight-reflecting particles up into the atmosphere because the project struggled with intense attention from the media and the scientific advisory committee.", "tag": [], "date": "2024-08-13"}
