{"title": "[Free Ebook] New Onboarding Strategies to Reduce Employee Turnover by 30% (Sponsor)", "link": "https://www.bamboohr.com/resources/ebooks/the-definitive-guide-to-onboarding-i1?utm_campaign=TLDR-DG-Primary+Defeinitive+Guide+Onboarding-202408&amp;utm_medium=paid-media&amp;utm_source=newsletter-ads&amp;utm_content=guide+onbdg24&amp;utm_term=onboarding", "description": "Companies spend $4,000+ and take 36 days to fill a position, only to lose 17% of new hires in their first month. In many cases, the problem is onboarding “sink or swim” processes.", "tag": [], "date": "2024-08-30"}
{"title": "Tesla Model Y refresh planned for Q1 2025, supply chain report claims (4 minute read)", "link": "https://electrek.co/2024/08/29/tesla-model-y-refresh-planned-q1-2025-supply-chain-report-claims/?utm_source=tldrnewsletter", "description": "A report from China claiming to use information from Tesla's supply chain states that Tesla is planning a Model Y refresh in the first quarter of 2025. Tesla is also reportedly planning to start production of a 7-seat Model Y at Gigafactory Shanghai soon. It is expected to be an upgraded version of the US seven-seater configuration for the Asian and European markets. Most of the changes made to the Model 3 in last year's refresh will make it to the new Model Y.", "tag": [], "date": "2024-08-30"}
{"title": "Apple, Nvidia Are in Talks to Invest in OpenAI (3 minute read)", "link": "https://www.wsj.com/tech/ai/openai-apple-funding-chatgpt-50754cd6?st=kw94cmbl59arfq3&reflink=desktopwebshare_permalink&utm_source=tldrnewsletter", "description": "Apple and Nvidia are in talks to invest in OpenAI as part of a fundraising round that would value OpenAI at above $100 billion. It is an unusual move for Apple, as the company doesn't usually invest in startups. Nvidia has stepped up its investment activity in the past two years, putting its money into AI-related companies. OpenAI is one of the largest users of Nvidia's AI chips.", "tag": [], "date": "2024-08-30"}
{"title": "The Impact of AI/ML in Drug Discovery Isn't Where You Think It Is (8 minute read)", "link": "https://x.com/ericdai_bioe/status/1828900078905602119?s=12&amp;utm_source=tldrnewsletter", "description": "Decision making in biotech is ridiculously difficult. ML systems can automate low- and medium-level decision making. These systems can generate more data and better synthesize that data into decisions. They are able to systematize human rational frameworks into quantitative, interpretable, and scalable analytic engines. Enabling model-driven decision making would require building an organization in a data centric way with an engineering culture.", "tag": [], "date": "2024-08-30"}
{"title": "Inside China's race to lead the world in nuclear fusion (17 minute read)", "link": "https://www.nature.com/articles/d41586-024-02759-x#Echobox=1724854962?utm_source=tldrnewsletter", "description": "The Chinese government's current five-year plan makes comprehensive research facilities for crucial fusion projects a major priority for the country's national science and technology infrastructure. It is estimated to be spending around $1.5 billion each year on fusion, almost double what the US government allocated this year for this research. The country has built itself from being a non-player 25 years ago to having world-class capabilities. Chinese scientists are aiming to build a test reactor with the goal of producing up to 1 gigawatt of fusion power in the 2030s.", "tag": [], "date": "2024-08-30"}
{"title": "✂️ Cut your QA cycles down to minutes with automated testing (Sponsor)", "link": "https://www.qawolf.com/?utm_campaign=CutQACycles07082024&amp;utm_source=tldr&amp;utm_medium=newsletter", "description": "Are slow test cycles bottlenecking your dev teams' release velocity? With ", "tag": [], "date": "2024-08-30"}
{"title": "Elasticsearch is Open Source, Again (4 minute read)", "link": "https://www.elastic.co/blog/elasticsearch-is-open-source-again?utm_source=tldrnewsletter", "description": "Elasticsearch and Kibana are now open source again. AGPL will be added as another license option next to Elv2 and SSPL in the coming weeks. Elastic changed its license 3 years ago to remove a lot of market confusion, but the landscape has changed so it is able to become open source again.", "tag": [], "date": "2024-08-30"}
{"title": "I just crossed $1 million on GitHub Sponsors 💰🎉 (17 minute read)", "link": "https://calebporzio.com/i-just-cracked-1-million-on-github-sponsors-heres-my-playbook?utm_source=tldrnewsletter", "description": "This developer recently crossed over $1 million on GitHub Sponsors after leaving their day job 5 years ago with no plan. In this article, they provide the strategy they followed to reach that achievement. The developer sold screencasts of them building stuff with their product. They also documented their work in detail through writing, speaking, and recordings.", "tag": [], "date": "2024-08-30"}
{"title": "Scaling Laws, Economics, and the AI \"Game of Emperors\" (8 minute read)", "link": "https://x.com/gavinsbaker/status/1828862999836102800?s=12&amp;utm_source=tldrnewsletter", "description": "The ROI on AI has been positive so far. Scaling laws may eventually collide with economics - if they hold. If scaling laws hold and there are no fundamental technology breakthroughs, then the models trained in 2026/2027 are likely to require clusters that cost well over $100 billion. At that point, the ROI on AI may begin declining.", "tag": [], "date": "2024-08-30"}
{"title": "California legislature passes controversial “kill switch” AI safety bill (3 minute read)", "link": "https://arstechnica.com/ai/2024/08/as-contentious-california-ai-safety-bill-passes-critics-push-governor-for-veto/?utm_source=tldrnewsletter", "description": "SB-1047 passed the California State Assembly by a 45-11 vote. It now faces just one more procedural state Senate vote before heading to the governor's desk. The bill asks AI model creators to implement a 'kill switch' that can be activated if a model starts introducing novel threats to public safety and security. It has been criticized for focusing on risks from an imagined future AI rather than real present-day harms like deepfakes or misinformation.", "tag": [], "date": "2024-08-30"}
{"title": "Meta says Llama's usage grew tremendously due to the power of open source (2 minute read)", "link": "https://www.engadget.com/ai/meta-says-llamas-usage-grew-tremendously-due-to-the-power-of-open-source-140020454.html?guccounter=1&amp;utm_source=tldrnewsletter", "description": "Meta's Llama large language models have been downloaded almost 350 million times, with approximately 20 million of those downloads taking place in the last month alone.", "tag": [], "date": "2024-08-30"}
{"title": "DEPΛRTURE MONO (Website)", "link": "https://departuremono.com/?utm_source=tldrnewsletter", "description": "Departure mono is a monospaced pixel font inspired by the constraints of early command-line and graphical user interfaces.", "tag": [], "date": "2024-08-30"}
{"title": "OpenAI says ChatGPT usage has doubled since last year (1 minute read)", "link": "https://www.axios.com/2024/08/29/openai-chatgpt-200-million-weekly-active-users?utm_source=tldrnewsletter", "description": "ChatGPT now has more than 200 million weekly active users.", "tag": [], "date": "2024-08-30"}
{"title": "Feds to get early access to OpenAI, Anthropic AI to test for doomsday scenarios (3 minute read)", "link": "https://arstechnica.com/tech-policy/2024/08/feds-to-get-early-access-to-openai-anthropic-ai-to-test-for-doomsday-scenarios/?utm_source=tldrnewsletter", "description": "OpenAI and Anthropic have signed deals granting the US government early access to conduct safety testing on their new AI models before they're released to the public.", "tag": [], "date": "2024-08-30"}
{"title": "Can China Tech Find a Home in Silicon Valley? (8 minute read)", "link": "https://www.nytimes.com/2024/08/29/business/china-venture-capital.html?unlocked_article_code=1.Gk4.y3hs.NDsNvmjJ7c7n&smid=url-share&utm_source=tldrnewsletter", "description": "Chinese tech professionals are moving to Silicon Valley for opportunities they don't believe are available in China anymore.", "tag": [], "date": "2024-08-30"}
{"title": "Bypassing airport security via SQL injection (5 minute read)", "link": "https://ian.sh/tsa?utm_source=tldrnewsletter", "description": "This post describes the process of discovering a bug that allowed anyone with a basic knowledge of SQL injection to add anyone they wanted to airport security systems.", "tag": [], "date": "2024-08-30"}
