{"title": "Apple Intensifies Talks With OpenAI for iPhone Generative AI Features (2 minute read)", "link": "https://www.bloomberg.com/news/articles/2024-04-26/apple-intensifies-talks-with-openai-for-iphone-generative-ai-features?utm_source=tldrnewsletter", "description": "Apple has renewed discussions with OpenAI to use its generative AI technology to power new features coming to the iPhone later this year. The companies were discussing a deal earlier this year, but work between the two parties has been minimal since then. Apple is still in discussions with Google about licensing the Gemini chatbot. It is unclear which provider Apple plans to eventually use.", "tag": [], "date": "2024-04-29"}
{"title": "Apple Event Rumors: iPad Pro With M4 Chip and New Apple Pencil With Haptic Feedback (1 minute read)", "link": "https://www.macrumors.com/2024/04/28/ipad-pro-m4-chip-and-apple-pencil-haptic-rumors/?utm_source=tldrnewsletter", "description": "Apple's 'Let Loose' event will be held on May 7 at 7 AM Pacific Time. There is a strong possibility that Apple will announce iPad Pros with M4 chips, a new Apple Pencil with haptic feedback, a 12.9-inch version of the iPad Air, and a redesigned Magic Keyboard for iPads. The event will be streamed on Apple's website and YouTube.", "tag": [], "date": "2024-04-29"}
{"title": "In the first Autonomous Racing League race, the struggle was real (2 minute read)", "link": "https://www.theverge.com/2024/4/27/24142989/a2rl-autonomous-race-cars-f1-abu-dhabi?utm_source=tldrnewsletter", "description": "The Abu Dhabi Autonomous Racing League has held its first race. The driverless Dallara Super Formula racers, outfitted with cameras and software, struggled to complete a full lap during qualifying time trials. Cars randomly juked, spun, and stopped during the trial. During the actual race, the lead racer spun out - and two out of the other three remaining cars stopped, unwilling to pass the spun-out car due to their rules. Clips from the race are available in the article.", "tag": [], "date": "2024-04-29"}
{"title": "Japan's Moon lander makes it through another lunar night (2 minute read)", "link": "https://www.theregister.com/2024/04/25/slim_another_lunar_night/?utm_source=tldrnewsletter", "description": "Japan's Smart Lander for Investigating Moon (SLIM) has survived three lunar nights. SLIM was only designed to last until the end of its first lunar day. Some of its electronics and batteries were already malfunctioning after the second lunar night. The sensors and other functions in the lander are gradually being lost, so the chances of it surviving a fourth lunar night are slim.", "tag": [], "date": "2024-04-29"}
{"title": "Google has laid off its Python Foundation team (1 minute read)", "link": "https://threadreaderapp.com/thread/1784450545509658867.html?utm_source=tldrnewsletter", "description": "Google has asked its recently laid-off Python Foundation team to train its replacements, who will be in the Munich office. The company similarly laid off its finance department a few weeks ago, moving positions outside of the country where they are cheaper. The Python Foundation team maintained a stable version of Python within Google, tools to keep thousands of third-party packages constantly updated from their open source versions, highly customized tools, and much more. It also acted as a help desk for Python users at Google. The team performed its duties for years with fewer than 10 people.", "tag": [], "date": "2024-04-29"}
{"title": "React 19 Beta (25 minute read)", "link": "https://react.dev/blog/2024/04/25/react-19?utm_source=tldrnewsletter", "description": "The React 19 Beta is now available on npm. The update includes new hooks, new APIS, and support for using async functions in transitions to handle pending states, errors, forms, and optimistic updates automatically. There are breaking changes, but they should not impact most apps. This article details the new features in the beta.", "tag": [], "date": "2024-04-29"}
{"title": "The walls of Apple's garden are tumbling down (12 minute read)", "link": "https://www.theverge.com/24141929/apple-iphone-imessage-antitrust-dma-lock-in?utm_source=tldrnewsletter", "description": "iPhones are just phones. Apple has been building the walls of its garden higher and higher to ensure customers use its own products and nothing else, but those walls are now threatening to come tumbling down. It no longer feels urgent to replace smartphones every few years. Apple's strategy of restricting users and developers is starting to fail as laws are being implemented to increase consumer choice. Being forced to react to regulations will make it harder for Apple to be a visionary, future-forward company.", "tag": [], "date": "2024-04-29"}
{"title": "TLDR is hiring a customer success manager (TLDR Job)", "link": "https://jobs.ashbyhq.com/tldr.tech/23d4f1eb-63be-44cf-9650-3cc11dca6447?utm_source=tldrnewsletter", "description": "We're hiring a customer success manager to help us improve our advertiser experience.", "tag": [], "date": "2024-04-29"}
{"title": "The Business of Takehome Assessments (18 minute read)", "link": "https://www.careerfair.io/takehome-assessments?utm_source=tldrnewsletter", "description": "This article looks at how the industry does takehome assessments. The median time for takehome assessments in the industry is 3 hours, with the longest taking 10 days. Only around 10% of companies compensate candidates for their work. The main complaints engineers have with takehome assessments are that they fail to define reasonable time caps and the requirements are open-ended. The majority of companies issuing takehomes are design studios, lean web development agencies, and mobile dev teams based out of Eastern Europe.", "tag": [], "date": "2024-04-29"}
{"title": "bun.report is Bun's new crash reporter (10 minute read)", "link": "https://bun.sh/blog/bun-report-is-buns-new-crash-reporter?utm_source=tldrnewsletter", "description": "bun.report creates crash reports that fit in a ~150 byte URL without containing any personal information.", "tag": [], "date": "2024-04-29"}
{"title": "Sleepsort: Sorting while sleeping (7 minute read)", "link": "https://animeshchouhan.com/posts/sleepsort/?utm_source=tldrnewsletter", "description": "Sleep sort is a quirky way to sort numbers that involves making numbers 'sleep' for a bit before joining the sorted list - it may not be the fastest way to sort numbers, but it is interesting because it is so different.", "tag": [], "date": "2024-04-29"}
{"title": "Once you get good at Rust all of these problems will go away (2 hour read)", "link": "https://loglog.games/blog/leaving-rust-gamedev/#once-you-get-good-at-rust-all-of-these-problems-will-go-away?utm_source=tldrnewsletter", "description": "This post, written by game developers who have released games built using a variety of coding languages, dispels commonly used arguments about Rust, such as that beginners are only facing the problems they are dealing with because they haven't learned or tried hard enough.", "tag": [], "date": "2024-04-29"}
{"title": "Elon Musk in China to discuss enabling full self driving (3 minute read)", "link": "https://www.bbc.com/news/business-68914929?utm_source=tldrnewsletter", "description": "Elon Musk wants to enable Full Self Driving in China and transfer data collected abroad to train its algorithms - Tesla is willing to cooperate with China to achieve mutually beneficial results.", "tag": [], "date": "2024-04-29"}
{"title": "China's Moon atlas is the most detailed ever made (5 minute read)", "link": "https://www.nature.com/articles/d41586-024-01223-0?utm_source=tldrnewsletter", "description": "The Chinese Academy of Sciences has released the highest-resolution geological maps of the Moon yet, revealing a total of 12,341 craters, 81 basins, and 17 rock types, along with other basic geological information about the lunar surface, at a scale of 1:2,500,000.", "tag": [], "date": "2024-04-29"}
