{"title": "Apple releases iOS 18 public beta for iPhone — Here's what's new and how to get it (4 minute read)", "link": "https://www.cnbc.com/2024/07/15/apple-ios-18-public-beta-release-how-to-install.html?utm_source=tldrnewsletter", "description": "The iOS 18 public preview is now available. The update allows users to put icons anywhere on the home screen, change app icon color, add lock screen shortcuts for apps other than camera and flashlight, and more. It has a more customizable Control Center menu and a redesigned Photos app. The update will only run on iPhones released in 2018 or later.", "tag": [], "date": "2024-07-16"}
{"title": "Zero to Billions: The Startup on the Verge of the Biggest Tech Exit in Years (6 minute read)", "link": "https://www.wsj.com/tech/how-startup-wiz-went-from-zero-to-a-possible-23-billion-sale-to-google-in-four-years-edb7c02b?st=9n411lk24ncilok&reflink=desktopwebshare_permalink&utm_source=tldrnewsletter", "description": "Cloud cybersecurity company Wiz was founded four years ago by four former Israeli military officers. It grew quickly to become the dominant company in cloud cybersecurity and is headed toward the largest exit for any tech startup since Rivian's $77 billion initial public offering in November 2021. Google is looking to acquire the company for a $23 billion sale price. The deal will likely draw scrutiny from antitrust regulators in the US and EU.", "tag": [], "date": "2024-07-16"}
{"title": "Immunotherapy Is Changing Cancer Treatment Forever (39 minute read)", "link": "https://nymag.com/intelligencer/article/cancer-treatment-immunotherapy-oncology-tcells-brain-tumor.html?utm_source=tldrnewsletter", "description": "The human immune system is very good at attacking anything it registers as a disease - if it could be turned against cancer, it could eliminate tumors more thoroughly than surgery and more durably than chemotherapy. Scientists have managed to modify T cells to react to cancer as if it were a virus and destroy it. The therapy has been used to remove glioblastomas, a common type of brain cancer with a median time of diagnosis to death of just over a year.", "tag": [], "date": "2024-07-16"}
{"title": "Where's the Synthetic Blood? (32 minute read)", "link": "https://www.asimov.press/p/synthetic-blood?utm_source=tldrnewsletter", "description": "The creation of synthetic blood is one of the holy grails of biomedical research. There are two main approaches to making synthetic blood products: the biologist's approach and the chemist's approach. The biologist's approach involves coaxing stem cells into becoming blood cells, while the chemist's approach synthesizes molecules and particles that mimic the functions of blood cells. Both approaches need to overcome economic and manufacturing challenges before they can scale for use in patients.", "tag": [], "date": "2024-07-16"}
{"title": "Why Facebook doesn't use Git (12 minute read)", "link": "https://graphite.dev/blog/why-facebook-doesnt-use-git?utm_source=tldrnewsletter", "description": "Facebook uses Mercurial instead of Git, building custom workflows on top of the tool for performance. Facebook used Git years ago, but it started facing performance issues, and the response from Git maintainers wasn't cooperative, with the maintainers pushing back on improving performance and instead recommending that Facebook shard its monorepo. The Facebook team looked at its alternatives and chose Mercurial, which had a community of maintainers who were welcoming to changes made by them. The story shows how kindness and openness can go far in the world of devtools.", "tag": [], "date": "2024-07-16"}
{"title": "SCALE by Spectral Compute# (3 minute read)", "link": "https://docs.scale-lang.com/?utm_source=tldrnewsletter", "description": "SCALE is a GPGPU programming toolkit that allows programs written using the popular CUDA language to be natively compiled for AMD GPUs. It accepts CUDA programs as is and serves as a drop-in replacement for nvcc. SCALE acts as an installation of the NVIDIA CUDA Toolkit, so it will work with existing build tools and scripts. It offers opt-in language extensions that can make writing GPU code easier and more efficient.", "tag": [], "date": "2024-07-16"}
