{"title": "Instagram confirms test of ‘unskippable' ads (4 minute read)", "link": "https://techcrunch.com/2024/06/03/instagram-confirms-test-of-unskippable-ads/?utm_source=tldrnewsletter", "description": "Instagram is testing unskippable ads. The ads display a countdown timer and stop users from being able to browse through more content on the app until they view the ad. Instagram has shifted over the years to become more of a video-sharing network, so it makes sense that it is considering becoming more like YouTube. The majority of reactions to the feature have been negative.", "tag": [], "date": "2024-06-04"}
{"title": "The Opaque Investment Empire Making OpenAI's Sam Altman Rich (19 minute read)", "link": "https://www.wsj.com/tech/ai/openai-sam-altman-investments-004fc785?st=wweh4f750w9e3ty&reflink=desktopwebshare_permalink&utm_source=tldrnewsletter", "description": "Sam Altman is one of Silicon Valley's most prolific and aggressive individual investors. He manages an investment empire with holdings worth at least $2.8 billion as of early this year. Much of the portfolio isn't widely known. This article takes readers through what's known about Altman's investments.", "tag": [], "date": "2024-06-04"}
{"title": "Fusion Tech Finds Geothermal Energy Application (5 minute read)", "link": "https://spectrum.ieee.org/geothermal-energy-gyrotron-quaise?utm_source=tldrnewsletter", "description": "Quaise Energy plans to deploy gyrotron drills to vaporize rocks using powerful microwaves to dramatically reduce the costs and timelines of drilling to fantastic depths. Gyrotrons use high-power linear-beam vacuum tubes to generate millimeter-length electromagnetic waves. The technology is used in nuclear fusion research to heat and control plasma. It could make technologies like geothermal energy viable in more areas of the planet.", "tag": [], "date": "2024-06-04"}
{"title": "Male birth control gel is safe and effective, new trial findings show (13 minute read)", "link": "https://www.nbcnews.com/health/mens-health/male-birth-control-gel-results-promising-rcna153349?utm_source=tldrnewsletter", "description": "A birth control gel for males, which contains testosterone and a synthetic hormone called Nestorone that reduces sperm production, is showing promise in clinical trials. Researchers recently presented encouraging phase 2 trial results on the hormonal gel. The second part of the two-part trial is still underway, but initial findings have found that the contraceptive works faster than expected. On average, the time for effective contraception was eight weeks. This article also covers some other types of male birth control currently under development.", "tag": [], "date": "2024-06-04"}
{"title": "Mesop (Website)", "link": "https://google.github.io/mesop/?utm_source=tldrnewsletter", "description": "Mesop is a Python-based UI framework that allows developers to rapidly build web and internal apps. It allows developers to write UI in idiomatic Python code without writing JavaScript, CSS, or HTML. Mesop features ready-to-use components, hot reload, rich IDE support, and more.  A demo gallery built in pure Mesop is available.", "tag": [], "date": "2024-06-04"}
{"title": "Announcing Brioche! (8 minute read)", "link": "https://brioche.dev/blog/announcing-brioche/?utm_source=tldrnewsletter", "description": "Brioche is a package manager and build tool designed to be flexible and easy to use. It leverages TypeScript for fancy type-checking and autocompletion. Brioche is currently in Technical Preview and limited to x86-64 Linux. This post includes an example Brioche project file to help developers get started.", "tag": [], "date": "2024-06-04"}
{"title": "Seeing Like a Data Structure (33 minute read)", "link": "https://www.belfercenter.org/publication/seeing-data-structure?utm_source=tldrnewsletter", "description": "Technology has become entangled with the structure of society and we can no longer see the world around us without it. Our data-centric way of seeing the world isn't serving us well. Tools are controlled by human users, whereas machines only do what their designers want. Technologists should build tools rather than machines. Seeing like a data structure is a choice and there are different paths we can take.", "tag": [], "date": "2024-06-04"}
{"title": "The End of Software (3 minute read)", "link": "https://docs.google.com/document/d/103cGe8qixC7ZzFsRu5Ww2VEW5YgH9zQaiaqbBsZ1lcc/edit?utm_source=tldrnewsletter", "description": "Media behaved very differently before the internet. It was expensive to create and distribute. The internet reduced the cost of creating content to zero, allowing a lot of user generated content to be created as creating content didn't cost anything anymore. Content behaved differently once it no longer had to make money. Software is expensive because developers are expensive. Large language models could drive the cost of creating software to zero - this will likely result in a Cambrian explosion of software, similar to what happened with content.", "tag": [], "date": "2024-06-04"}
{"title": "Palmer Luckey is now selling pixel-perfect ultrabright magnesium Game Boys for $199 (6 minute read)", "link": "https://www.theverge.com/2024/6/3/24170572/modretro-chromatic-game-boy-color-palmer-luckey-price-release-date?utm_source=tldrnewsletter", "description": "The ModRetro Chromatic features a magnesium alloy case, sapphire crystal cover glass, PBT buttons, a pixel-perfect IPS screen, and a screen capable of well over a thousand nits of brightness.", "tag": [], "date": "2024-06-04"}
{"title": "Why YC went to DC (4 minute read)", "link": "https://www.ycombinator.com/blog/why-yc-went-to-dc?utm_source=tldrnewsletter", "description": "Y Combinator president Garry Tan went to DC to start engaging policymakers and to be the voice of little tech.", "tag": [], "date": "2024-06-04"}
{"title": "In Defense of the New (11 minute read)", "link": "https://www.greaterstill.blog/p/in-defense-of-the-new?utm_source=tldrnewsletter", "description": "Technology gives individuals choice and control - it is enabling people to move to more attractive places and create entirely new communities.", "tag": [], "date": "2024-06-04"}
{"title": "Why I retired from the tech crusades (4 minute read)", "link": "https://world.hey.com/dhh/why-i-retired-from-the-tech-crusades-107a51ea?utm_source=tldrnewsletter", "description": "It's possible to attract people who aren't happy with their current circumstances to give an alternative a chance if you simply show how it works and allow them to conclude by themselves what the better choice is.", "tag": [], "date": "2024-06-04"}
{"title": "Intel details new Lunar Lake CPUs to fight off AMD, Qualcomm, and Apple (9 minute read)", "link": "https://arstechnica.com/gadgets/2024/06/intels-new-lunar-lake-chips-promise-big-gpu-and-npu-upgrades-minor-cpu-boosts/?utm_source=tldrnewsletter", "description": "Intel's Lunar Lake CPUs will feature a neural processing unit that meets Microsoft's Copilot+ PC requirements, upgraded architectures for its P-cores and E-cores, next-generation GPU architectures, and some packaging changes.", "tag": [], "date": "2024-06-04"}
{"title": "Synthetic Plugs Could Reduce Need for Total Knee Replacements (3 minute read)", "link": "https://www.technologynetworks.com/tn/news/synthetic-plugs-could-reduce-need-for-total-knee-replacements-387340?utm_source=tldrnewsletter", "description": "Synthetic cartilage-capped regenerative osteochondral plugs can be implanted with existing surgical tools and protocols, do not require pre-loading with cells or growth factors to induce healing, and provide immediate support for joint function once implanted.", "tag": [], "date": "2024-06-04"}
