{"title": "Inside Microsoft's mission to take down the MacBook Air (7 minute read)", "link": "https://www.theverge.com/2024/5/20/24160463/microsoft-windows-laptops-copilot-arm-chips-m1?utm_source=tldrnewsletter", "description": "Microsoft recently spent an entire day pitting its new hardware against the MacBook Air. Its new Surface devices, equipped with Qualcomm's Snapdragon X Elite chips, pulled ahead in tests against Apple's category-leading laptop. Microsoft's Copilot Plus PCs feature an improved emulator that can emulate apps twice as fast as the previous generation of Windows on Arm devices. They are equipped with a neural processing unit that can perform more AI task operations per watt than the MacBook Air M3 and Nvidia's RTX 4060. Microsoft's Copilot Plus PCs will hit the market this summer.", "tag": [], "date": "2024-05-21"}
{"title": "Elon Musk's Neuralink Gets FDA Green Light for Second Patient, as First Describes His Emotional Journey (5 minute read)", "link": "https://www.wsj.com/tech/neuralink-gets-fda-green-light-for-second-patient-as-first-describes-his-emotional-journey-a2707584?st=iemfrvz8kj2kcw1", "description": "The US Food and Drug Administration has given the green light for Neuralink to implant its brain chip in a second person. Most of the threads implanted in the first participant have come loose and are no longer reading the electrical signals needed to translate his thoughts into cursor movements. While software changes have helped him regain many of the device's capabilities, only around 15% of the threads inserted in his brain remain in place. Neuralink's proposed fix for the problem that occurred in the first test participant involves embedding some of the device's ultrathin wires deeper into the brain.", "tag": [], "date": "2024-05-21"}
{"title": "We take a stab at decoding SpaceX's ever-changing plans for Starship in Florida (21 minute read)", "link": "https://arstechnica.com/space/2024/05/we-take-a-stab-at-decoding-spacexs-ever-changing-plans-for-starship-in-florida/?utm_source=tldrnewsletter", "description": "The Federal Aviation Administration is kicking off a new environmental review of SpaceX's plan to launch Starships from Florida. The US Space Force is overseeing a similar Environmental Impact Statement review for SpaceX's proposal to take over a launch pad at Cape Canaveral Space Force Station. While the reviews can take a while and may delay SpaceX's plans, they show that SpaceX is finally cementing its plans to launch Starship from Florida.", "tag": [], "date": "2024-05-21"}
{"title": "Single brain implant restores bilingual communication to paralyzed man (5 minute read)", "link": "https://arstechnica.com/science/2024/05/single-brain-implant-gives-paralyzed-man-bilingual-communication/?utm_source=tldrnewsletter", "description": "Researchers found that the area of the brain where the intention to speak gets translated into control over the vocal tract produces consistent signals for both English and Spanish, allowing systems trained on English phrases to improve on their recognition of Spanish. The process of detecting these signals is complex, and it can result in high error rates. Piping the output through a large language model resulted in lower error rates. The study showed that the parts of the brain that control the muscles needed to speak aren't picky about which language they're handling.", "tag": [], "date": "2024-05-21"}
{"title": "Writing commit messages (58 minute read)", "link": "https://www.chiark.greenend.org.uk/~sgtatham/quasiblog/commit-messages/?utm_source=tldrnewsletter", "description": "This post discusses how to write a good commit message that focuses on information. It's important to consider the audience when writing a commit message, as many people might read them for lots of different reasons. The post covers what to include in a commit message and other places to post messages. It also covers typography, but attempts to keep the topic to a bare minimum.", "tag": [], "date": "2024-05-21"}
{"title": "importx (GitHub Repo)", "link": "https://github.com/antfu/importx?utm_source=tldrnewsletter", "description": "importx is a unified tool for importing TypeScript modules at runtime. It makes it easy to switch between different loaders. The library aims to swallow the complexity of the underlying implementations so developers can focus on the feature sets they need.", "tag": [], "date": "2024-05-21"}
{"title": "Google CEO Sundar Pichai on AI-powered search and the future of the web (42 minute read)", "link": "https://www.theverge.com/24158374/google-ceo-sundar-pichai-ai-search-gemini-future-of-the-internet-web-openai-decoder-interview?utm_source=tldrnewsletter", "description": "This article contains an interview with Google CEO Sundar Pichai conducted the day after the Google I/O developer conference last week. Google is building AI into virtually all of its products. The company is currently rolling out AI Overviews in Search, a move that will change the internet ecosystem as we know it. Pichai says that injecting AI into Search is about creating value for users and that users are clicking on links at higher rates in the AI previews. There is a deep tension between Google's vision for the future and the very real fears and anxieties creators and website owners are feeling about how search has changed and how AI might change the internet forever.", "tag": [], "date": "2024-05-21"}
{"title": "Taking Risk (9 minute read)", "link": "https://tomblomfield.com/post/750852175114174464/taking-risk?utm_source=tldrnewsletter", "description": "Startup founders in the US imagine the range of possible scenarios and pitch the top one percent outcome. This approach matches what venture Capitalists are looking for - it's an industry based on outlier returns. While most investments will fail completely, some will make a modest return, and a small percentage will be worth a thousand times what was paid initially - these successes easily pay for all of the other failures. The downside of early-stage investing is losing 1x your money, but the upside is that you make 1,000x - this is where you should focus your attention.", "tag": [], "date": "2024-05-21"}
{"title": "The Lunacy of Artemis (42 minute read)", "link": "https://idlewords.com/2024/5/the_lunacy_of_artemis.htm?utm_source=tldrnewsletter", "description": "There's a lot to NASA's Artemis' technical design - it goes beyond complex, with none of the puzzle pieces seeming to come from the same box and half of the breakthroughs the program requires making the other half unnecessary.", "tag": [], "date": "2024-05-21"}
{"title": "Fundamentals (21 minute read)", "link": "https://blog.ploeh.dk/2024/05/20/fundamentals/?utm_source=tldrnewsletter", "description": "It's a better investment of time to study fundamentals, rather than specifics - once you have some foundation knowledge, you can apply it in many circumstances.", "tag": [], "date": "2024-05-21"}
{"title": "How to use Google Search without AI: the ‘udm=14' work around (4 minute read)", "link": "https://venturebeat.com/ai/how-to-use-google-search-without-ai-the-udm14-work-around/?utm_source=tldrnewsletter", "description": "Adding '&udm=14' to the end of the Google URL will set 'Web' as the default search mode - this strips away all GenAI results, Featured Snippets, and most ads/sponsored posts.", "tag": [], "date": "2024-05-21"}
{"title": "Scarlett Johansson says lawyers got OpenAI to shut down \"Her\" voice (3 minute read)", "link": "https://www.axios.com/2024/05/20/scarlet-johansson-openai-chatgpt-sam-altman?utm_source=tldrnewsletter", "description": "The 'Sky' voice offered by ChatGPT sounds like the AI assistant Scarlett Johansson played in the AI romance movie 'Her'.", "tag": [], "date": "2024-05-21"}
{"title": "Microsoft wants to make Windows an AI operating system, launches Copilot Plus PCs (4 minute read)", "link": "https://techcrunch.com/2024/05/20/microsoft-build-2024-here-are-all-the-ai-and-hardware-products-microsoft-announced/?utm_source=tldrnewsletter", "description": "This article rounds up all of the major announcements Microsoft just made, including a new lineup of Copilot Plus PCs and generative AI-powered features like Recall, which helps users find apps, files, and other content they have viewed in the past.", "tag": [], "date": "2024-05-21"}
{"title": "Beautiful motivations (2 minute read)", "link": "https://world.hey.com/dhh/beautiful-motivations-6fef7c73?utm_source=tldrnewsletter", "description": "Making something beautiful takes extra steps - steps that show extra care with the rest of the creation.", "tag": [], "date": "2024-05-21"}
