{"title": "“The king is dead” — Claude 3 surpasses GPT-4 on Chatbot Arena for the first time (4 minute read)", "link": "https://arstechnica.com/information-technology/2024/03/the-king-is-dead-claude-3-surpasses-gpt-4-on-chatbot-arena-for-the-first-time/?utm_source=tldrnewsletter", "description": "Anthropic's Claude 3 Opus has surpassed OpenAI's GPT-4 for the first time on Chatbot Arena. Chatbot Arena is a leaderboard run by the Large Model Systems Organization, a research organization dedicated to open models. Its site allows visitors to rate outputs from various models, enabling it to calculate the best models in aggregate. While Claude's rise is notable, GPT-4 is now over a year old.", "tag": [], "date": "2024-03-28"}
{"title": "Google’s Pixel 9 will reportedly come in three sizes this fall (2 minute read)", "link": "https://www.theverge.com/2024/3/27/24113456/google-pixel-9-pro-xl-rumor-leak?utm_source=tldrnewsletter", "description": "Google plans to release three models of the upcoming Pixel 9 this year. There will be two versions in the premium range, the Pixel 9 Pro and Pixel 9 Pro XL. The Pixel 9 will have a 6.03-inch display, the Pixel 9 Pro will have a 6.2-inch display, and the Pixel 9 Pro XL will have a 6.5-inch display. Both Pro models will include a triple-camera system on the back. The new Pixels aren't expected to be released until October.", "tag": [], "date": "2024-03-28"}
{"title": "Elon Musk says Tesla Optimus robot should cost ‘less than half of a car’ (3 minute read)", "link": "https://electrek.co/2024/03/27/elon-musk-tesla-optimus-robot-cost-less-than-half-car/?utm_source=tldrnewsletter", "description": "Elon Musk says that Tesla's general-purpose humanoid robot Optimus, designed to take over repetitive tasks from humans, should cost less than half the price of a car. He has previously claimed that the demand for the robot could be as high as 10 to 20 billion units and that it would account for a majority of Tesla's long-term value. There is no clear timeline for when the robot will begin production, but Tesla has been listing more jobs for its robot program lately, including positions related to supply chains and manufacturing.", "tag": [], "date": "2024-03-28"}
{"title": "Scientists Find Human Brains Are Getting Larger and Larger (2 minute read)", "link": "https://futurism.com/neoscope/human-brains-larger?utm_source=tldrnewsletter", "description": "A study on MRIs of people born in the 1930s through to the 1970s found that babies in the 1970s had nearly 15% more brain surface area and 6.6% more brain volume than in the 1930s. Parts of the brain associated with memory and learning have also increased in size. It is unclear if larger brains make people more intelligent, but it could still be a plus as there are links to better brain health. Larger brain structures may reflect improved brain development and health. The percentage of people diagnosed with Alzheimer's Disease has decreased every decade.", "tag": [], "date": "2024-03-28"}
{"title": "The one about the web developer job market (35 minute read)", "link": "https://www.baldurbjarnason.com/2024/the-one-about-the-web-developer-job-market/?utm_source=tldrnewsletter", "description": "The developer job market is the worst it has been in over two decades, even with the AI bubble in full force. It is unlikely to ever fully bounce back. Finding a good job is only going to get harder - the overall market might fluctuate, but there isn't much on the horizon that seems likely to turn the decline around. Effective documentation, information, and training will likely start getting harder to find, especially in areas where AI is even less effective than normal.", "tag": [], "date": "2024-03-28"}
{"title": "42.parquet – A Zip Bomb for the Big Data Age (5 minute read)", "link": "https://duckdb.org/2024/03/26/42-parquet-a-zip-bomb-for-the-big-data-age.html?utm_source=tldrnewsletter", "description": "Apache Parquet, the de facto standard for tabular data exchange, uses a binary, columnar, and compressed data representation and comes with enough metadata so that files can be correctly interpreted without additional information. The format is supported by most modern data tools and services. Parquet files come with some risks - even perfectly valid files can be problematic. This article discusses how to exploit one of the vulnerabilities in the Parquet file format to create a 'zip bomb' that is only 42 kilobytes large but contains 622 trillion values, requiring over 4 petabytes of memory to decompress.", "tag": [], "date": "2024-03-28"}
{"title": "The Fight for AI Talent: Pay Million-Dollar Packages and Buy Whole Teams (6 minute read)", "link": "https://www.wsj.com/tech/ai/the-fight-for-ai-talent-pay-million-dollar-packages-and-buy-whole-teams-c370de2b?st=2l78j42j10xntba&amp;reflink=desktopwebshare_permalink&amp;utm_source=tldrnewsletter", "description": "The AI boom is pushing the industry's talent wars to new extremes, with companies offering million-dollar annual compensation packages and accelerating stock-vesting schedules to draw people with expertise and experience to develop generative AI technologies. This is happening as layoffs continue in other areas of tech. While there is a surplus of software engineers, the number of candidates who have trained large language models from scratch or can help solve vexing problems in AI is scarce. Salespeople in AI are also in demand.", "tag": [], "date": "2024-03-28"}
{"title": "How AI could explode the economy (21 minute read)", "link": "https://www.vox.com/future-perfect/24108787/ai-economic-growth-explosive-automation?utm_source=tldrnewsletter", "description": "Artificial intelligence is already making people rich, but some researchers think this is only the beginning. AI may be set to make society much richer by causing economic growth at a scale it has never experienced before. This article looks at arguments for why such a dramatic explosion in economic growth might be possible. Explosive growth without causing a loss in jobs may be possible, but even a small boost can wind up changing all of our lives.", "tag": [], "date": "2024-03-28"}
{"title": "Usage-based GPT earnings (1 minute read)", "link": "https://twitter.com/OpenAI/status/1773032605002203559?utm_source=tldrnewsletter", "description": "OpenAI is partnering with a small group of US builders to test usage-based GPT earnings with the goal of creating a vibrant ecosystem where builders are rewarded for their creativity and impact.", "tag": [], "date": "2024-03-28"}
{"title": "Amazon spends $2.75 billion on AI startup Anthropic in its largest venture investment yet (7 minute read)", "link": "https://www.cnbc.com/2024/03/27/amazon-spends-2point7b-on-startup-anthropic-in-largest-venture-investment.html?utm_source=tldrnewsletter", "description": "Amazon will maintain a minority stake in the company but won't have an Anthropic board seat.", "tag": [], "date": "2024-03-28"}
{"title": "The Disney Plus-Hulu merger is way more than a streaming bundle (7 minute read)", "link": "https://www.theverge.com/2024/3/27/24112747/disney-plus-hulu-tile-app-streaming?utm_source=tldrnewsletter", "description": "Hulu's integration into Disney involved a large transfer of assets and a huge reworking of underlying infrastructure that will change the way Disney thinks about, creates, and distributes content.", "tag": [], "date": "2024-03-28"}
{"title": "How to make $1M, $5M, or $10M+ in Silicon Valley (2 minute read)", "link": "https://x.com/gaganbiyani/status/1773035170515550689?s=46&amp;utm_source=tldrnewsletter", "description": "A look at how some startup career climbers, small business owners, engineers, and founders 'made it' in Silicon Valley.", "tag": [], "date": "2024-03-28"}
{"title": "Apple Turns to Longtime Steve Jobs Disciple to Defend Its ‘Walled Garden’ (9 minute read)", "link": "https://www.wsj.com/tech/apple-turns-to-longtime-steve-jobs-disciple-to-defend-its-walled-garden-2ab44fae?st=z73j2xcmpvfrf9h&amp;reflink=desktopwebshare_permalink&amp;utm_source=tldrnewsletter", "description": "Phil Schiller says that the whole developer ecosystem has benefited from the work Apple has done together with them.", "tag": [], "date": "2024-03-28"}
{"title": "Leaked images reveal Microsoft’s white disc-less Xbox Series X console (2 minute read)", "link": "https://www.theverge.com/2024/3/27/24114048/microsoft-xbox-series-x-white-digital-edition-leak-rumor?utm_source=tldrnewsletter", "description": "The leaked images, available in the article, show a disc-less system with the same exterior design as the existing black Xbox Series X.", "tag": [], "date": "2024-03-28"}
