{"title": "OpenAI's GPT-5 Pushed Back To Late 2025, But Promises Ph.D.-Level Abilities (2 minute read)", "link": "https://in.mashable.com/tech/77593/openais-gpt-5-pushed-back-to-late-2025-but-promises-phd-level-abilities?utm_source=tldrnewsletter", "description": "GPT-5 will be significantly more intelligent than GPT-4. It is still at least a year and a half from release. The model will have advanced memory and reasoning capabilities and Ph.D.-level intelligence in specific tasks. A short video of OpenAI's Chief Technology Officer Mira Murati comparing the different GPTs is available in the article.", "tag": [], "date": "2024-06-24"}
{"title": "TikTok confirms it offered US government a 'kill switch' (3 minute read)", "link": "https://www.bbc.com/news/articles/cxwwz7l02j0o?utm_source=tldrnewsletter", "description": "TikTok offered the US government the power to shut the platform down in 2022 in an attempt to address lawmakers' data protection and national security concerns. It suggested a mechanism that would have allowed the government to suspend the platform in the US if it did not follow certain rules such as properly funding its data protection units and making sure that ByteDance did not have access to US users' data. The US government refused to engage in serious settlement talks after 2022. It ignored requests to meet for further negotiations and did not respond to TikTok's invitation for it to visit and inspect its Dedicated Transparency Center in Maryland.", "tag": [], "date": "2024-06-24"}
{"title": "NASA indefinitely delays return of Starliner to review propulsion data (4 minute read)", "link": "https://arstechnica.com/space/2024/06/nasa-indefinitely-delays-return-of-starliner-to-review-propulsion-data/?utm_source=tldrnewsletter", "description": "NASA has adjusted the date of the Starliner spacecraft's return to Earth to an unspecified time in July. The spacecraft was originally due to undock and return to Earth on June 14, but return opportunities have been waved off as more time is needed to review the data from the vehicle's problematic flight to the International Space Station. There were five separate leaks in the helium system that pressurizes Starliner's propulsion system and five of the vehicle's 28 reaction-control system thrusters failed as Starliner approached the station. NASA has not specified why it is not yet comfortable with releasing Starliner to fly back to Earth.", "tag": [], "date": "2024-06-24"}
{"title": "Radioactive drugs strike cancer with precision (15 minute read)", "link": "https://arstechnica.com/science/2024/06/radioactive-drugs-strike-cancer-with-precision/?utm_source=tldrnewsletter", "description": "Radiation therapy has come a long way since X-ray therapy was born in 1896. Targeted radiopharmaceuticals helped the field achieve a new level of molecular precision. These agents deliver their radioactive payloads directly at tumor sites. While there are only a handful of these therapies commercially available for patients, the number is poised to grow as major players in the biopharmaceutical industry start to invest heavily in the technology.", "tag": [], "date": "2024-06-24"}
{"title": "llama.ttf (3 minute read)", "link": "https://fuglede.github.io/llama.ttf/?utm_source=tldrnewsletter", "description": "llama.ttf is a font file, large language model, and inference engine for that model. Harfbuzz, a font shaping engine, has a Wasm shaper that allows arbitrary code to be used to shape text. This code can be anything - so llama.ttf uses an entire LLM inference engine with trained parameters bundled inside. The result is a font that can generate text locally in any Wasm-enabled Harfbuzz-based application. A video demonstration is available.", "tag": [], "date": "2024-06-24"}
{"title": "Inside Netflix's bet on advanced video encoding (16 minute read)", "link": "https://www.theverge.com/2024/6/22/24171581/netflix-bet-advanced-encoding-anne-aaron?utm_source=tldrnewsletter", "description": "Netflix's encoding team has enabled the company to deliver better-looking streams over slower connections and has resulted in 50 percent bandwidth savings for 4K streams. It has contributed to industry-wide efforts, including developing the AV1 video codec and its eventual successor. The company is starting to move into more live streaming, which will necessitate a completely different encoding pipeline than what it uses for VOD. Its encoding team will have to basically start all over to develop encoding that achieves the same bandwidth requirements as VOD but in a faster, real-time way.", "tag": [], "date": "2024-06-24"}
{"title": "AI Doesn't Kill Jobs? Tell That to Freelancers (8 minute read)", "link": "https://www.wsj.com/tech/ai/ai-replace-freelance-jobs-51807bc7?st=qh1hg1h1gosfc8i&reflink=desktopwebshare_permalink&utm_source=tldrnewsletter", "description": "Freelance jobs that require basic writing, coding, or translation are disappearing across job boards. The number of freelance jobs posted on online platforms in the areas in which generative AI excels has dropped by as much as 21% since the debut of ChatGPT and other generative AI models. Some companies are returning to freelancers as they are finding that AI-generated content isn't up to par - while AI-generated material may look good to those in marketing, it often reads as word salad to more knowledgeable people, especially on niche topics.", "tag": [], "date": "2024-06-24"}
{"title": "The manager's unbearable lack of endorphins (6 minute read)", "link": "https://jamie.ideasasylum.com/2024/06/21/the-manager-s-unbearable-lack-of-endorphins?utm_source=tldrnewsletter", "description": "Completing tasks and reaching goals feels good and makes you feel competent. Most people don't get this feeling from managing people. Management can be demoralizing due to the lack of measurable progress. Contributions are often several levels, and often weeks/months, removed from success events. This is the nature of management work.", "tag": [], "date": "2024-06-24"}
{"title": "Programmers Should Never Trust Anyone, Not Even Themselves (9 minute read)", "link": "https://carbon-steel.github.io/jekyll/update/2024/06/19/abstractions.html?utm_source=tldrnewsletter", "description": "Abstractions allow us to think efficiently, but programmers who learn superficially will not succeed on difficult projects that come with known solutions and involve multiple domains of expertise.", "tag": [], "date": "2024-06-24"}
{"title": "I am using AI to automatically drop hats outside my window onto New Yorkers (7 minute read)", "link": "https://dropofahat.zone/?utm_source=tldrnewsletter", "description": "This entrepreneur developed a system that sells hats for him directly from his New York City window.", "tag": [], "date": "2024-06-24"}
{"title": "Designing a website to not have 404s (2 minute read)", "link": "https://pillser.com/engineering/2024-06-10-website-without-404s?utm_source=tldrnewsletter", "description": "Implement fuzzy matching for URLs to redirect users to the right place when they make a typo, a product is renamed, or the logic used to generate URLs changes.", "tag": [], "date": "2024-06-24"}
{"title": "Secrets of the ChatGPT Linux system (9 minute read)", "link": "https://incoherency.co.uk/blog/stories/chatgpt-linux.html?utm_source=tldrnewsletter", "description": "A look at how ChatGPT executes Python code.", "tag": [], "date": "2024-06-24"}
{"title": "Ask HN: Advice for leading a software migration? (Hacker News Thread)", "link": "https://news.ycombinator.com/item?id=40757486&amp;utm_source=tldrnewsletter", "description": "Anecdotes and advice from developers about performing decent sized software migrations.", "tag": [], "date": "2024-06-24"}
{"title": "Apple, Meta Have Discussed an AI Partnership (4 minute read)", "link": "https://www.wsj.com/tech/ai/apple-meta-have-discussed-an-ai-partnership-cc57437e?st=ykcwscnj8ud9rik&reflink=desktopwebshare_permalink&utm_source=tldrnewsletter", "description": "Apple has discussed an AI partnership with several companies, including Meta, Google, Anthropic, and Perplexity.", "tag": [], "date": "2024-06-24"}
