{"title": "iOS 18 May Feature All-New 'Safari Browsing Assistant' (2 minute read)", "link": "https://www.macrumors.com/2024/04/10/ios-18-safari-browsing-assistant-rumor/?utm_source=tldrnewsletter", "description": "iOS 18 will apparently feature a new Safari browsing assistant. While the code for the feature has been confirmed to exist, not many details about it are known. Apple is also apparently working on an 'Encrypted Visual Search' feature. iOS is set to be unveiled during Apple's WWDC keynote on June 10.", "tag": [], "date": "2024-04-11"}
{"title": "Google brings AI-powered editing tools, like Magic Editor, to all Google Photos users for free (3 minute read)", "link": "https://techcrunch.com/2024/04/10/google-brings-ai-powered-editing-tools-like-magic-editor-to-all-google-photos-users-for-free/?utm_source=tldrnewsletter", "description": "Google has made a handful of editing features previously exclusive to Pixel devices and paid subscribers free to all Google Photos users. The features include the AI-powered Magic Editor, Magic Eraser, Photo Unblur, and Portrait Light. They will only work on devices running Android 8.0 or iOS 15 or higher and on Chromebook Plus devices with at least 3GB RAM and ChromeOS version 118+. The tools will start rolling out on May 15 - it may take weeks for them to make it to all users.", "tag": [], "date": "2024-04-11"}
{"title": "Hopes rise for mRNA cancer vaccine after Moderna trial shows promise (1 minute read)", "link": "https://www.semafor.com/article/04/10/2024/hopes-rise-for-mrna-cancer-vaccine-after-moderna-trial-shows-promise?utm_source=tldrnewsletter", "description": "Moderna's mRNA cancer vaccine, developed to target melanoma, might also treat a form of head and neck cancer. Data from an early trial showed a greater survival rate for patients who took Moderna's cancer vaccine alongside immunotherapy treatments. The news sent Moderna's share price soaring.", "tag": [], "date": "2024-04-11"}
{"title": "Astranis unveils Omega ‘MicroGEO’ satellites for beaming dedicated broadband down from high orbit (5 minute read)", "link": "https://techcrunch.com/2024/04/10/astranis-unveils-omega-microgeo-satellites-for-beaming-dedicated-broadband-down-from-high-orbit/?utm_source=tldrnewsletter", "description": "Astranis, a company that builds and operates relatively small broadband satellites in high orbits, has unveiled a new generation of communications satellites that will serve broadband to Earth from geostationary orbit faster than any existing comsat. The new class of satellites, called Omega, can provide 50 gigabits per second of bandwidth each in both civilian and military bands. Astranis' relatively smaller satellites make them harder to target, making the infrastructure more resilient to attacks. The company plans to complete its first Omega satellite in 2025 and launch as many as 24 per year to orbit starting in 2026.", "tag": [], "date": "2024-04-11"}
{"title": "Client libraries are better when they have no API (7 minute read)", "link": "https://csvbase.com/blog/7?utm_source=tldrnewsletter", "description": "csvbase uses a client library with no API. It can pull dataframes using any dataframe library that uses the fsspec standard file system interface library. fsspec, which is well used but not well known, comes with built-in adaptors for object stores, webdav, GitHub, Dropbox, and more. This post explains how to use fsspec in your own programs.", "tag": [], "date": "2024-04-11"}
{"title": "Shell History Is Your Best Productivity Tool (8 minute read)", "link": "https://martinheinz.dev/blog/110?utm_source=tldrnewsletter", "description": "Shell history can be a personal knowledge vault, documentation, and command reference. This personal documentation can provide huge boosts to productivity. This article provides tips on how to optimize shell history configuration and usage to get the most out of it. The tips in the article focus on ZSH, but similar results can be achieved in Bash and other shells.", "tag": [], "date": "2024-04-11"}
{"title": "Gemini 1.5 and Google’s Nature (14 minute read)", "link": "https://stratechery.com/2024/gemini-1-5-and-googles-nature/?utm_source=tldrnewsletter", "description": "Google claims to have the best infrastructure for AI. Its deep investments into AI have helped customers train and serve cutting-edge language models and put the company at the forefront of the AI platform shift. This article looks at how Google's infrastructure helps companies transform their operations and what that says about Google's ability to compete. Google may have to shift to a different business model, but its reliance on scale and overwhelming infrastructure advantage won't change - because it's the company's nature.", "tag": [], "date": "2024-04-11"}
{"title": "Alternative browsers report uplift after EU’s DMA choice screen mandate (12 minute read)", "link": "https://techcrunch.com/2024/04/10/eu-dma-browser-choice-screen-early-impact/?utm_source=tldrnewsletter", "description": "A month since the Digital Markets Act came into application, there are early signs that it is having an impact in stirring the competitive pot and helping smaller browser makers gain share. The new rules require internet gatekeepers to display browser choice screens that point users to alternatives. It is still early days, but several browser companies have shared positive stories of increased interest. Many regional mobile users have yet to see a choice screen appear on their devices as changes are still rolling out.", "tag": [], "date": "2024-04-11"}
{"title": "How Deep Does Life Go? (16 minute read)", "link": "https://thereader.mitpress.mit.edu/how-deep-does-life-go/?utm_source=tldrnewsletter", "description": "Microbial life could exist beneath Earth's surface in extreme environments long thought to be inhospitable.", "tag": [], "date": "2024-04-11"}
{"title": "Nvidia employees are getting richer with a 'special Jensen grant' that boosts their stock awards by 25% (2 minute read)", "link": "https://news.yahoo.com/tech/nvidia-employees-getting-richer-special-095141943.html?utm_source=tldrnewsletter", "description": "The Jensen special grant will vest over four years, with the first portion coming in September.", "tag": [], "date": "2024-04-11"}
{"title": "Meta’s new AI chips run faster than before (3 minute read)", "link": "https://www.theverge.com/2024/4/10/24125924/meta-mtia-ai-chips-algorithm-training?utm_source=tldrnewsletter", "description": "The Meta Training and Inference Accelerator chip, which makes training more efficient and inference easier, was not expected to be released until 2025, but a second version of the chip is already in production.", "tag": [], "date": "2024-04-11"}
{"title": "The Rise and Impending Fall of the Dental Cavity (28 minute read)", "link": "https://www.cremieux.xyz/p/the-rise-and-impending-fall-of-the?utm_source=tldrnewsletter", "description": "A new treatment for cavities will soon be available for home delivery in the US for the price of a single dental filling - it could eliminate the bacteria that causes dental cavities in humans completely.", "tag": [], "date": "2024-04-11"}
{"title": "Avi Wigderson, Complexity Theory Pioneer, Wins Turing Award (8 minute read)", "link": "https://www.quantamagazine.org/avi-wigderson-complexity-theory-pioneer-wins-turing-award-20240410/?utm_source=tldrnewsletter", "description": "Wigderson was named the winner of the A.M. Turing Award for his foundational contributions to the theory of computation, which has touched nearly every area of the field.", "tag": [], "date": "2024-04-11"}
{"title": "The $10,000 BYD Seagull EV is scaring the U.S. auto industry (4 minute read)", "link": "https://www.teslarati.com/10000-byd-seagull-us-auto/?utm_source=tldrnewsletter", "description": "While BYD isn't planning to enter the US, its entry into North America is considered an eventuality, and other Chinese automakers likely won't be far behind.", "tag": [], "date": "2024-04-11"}
