{"title": "TikTok Sues to Block U.S. Ban (8 minute read)", "link": "https://www.wsj.com/politics/policy/tiktok-sues-to-block-u-s-ban-6ec6e17f?st=vexhd3ip57h0yza", "description": "TikTok has filed a federal lawsuit challenging the constitutionality of the new law requiring the sale or ban of the company. The suit seeks a court order preventing the US from enforcing the law. It accuses the US of trampling on TikTok's First Amendment rights under the banner of national security. Parent company ByteDance says it can't and won't sell its US operations by the deadline, leaving litigation as its best hope to remain in the US market. It claims to have taken measures to safeguard user data and prevent Chinese influence.", "tag": [], "date": "2024-05-08"}
{"title": "Everything announced at Apple's Let Loose iPad event (6 minute read)", "link": "https://www.engadget.com/everything-announced-at-apples-let-loose-ipad-event-161005007.html?utm_source=tldrnewsletter", "description": "Apple's Let Loose showcase was all about the iPad. The next iPad Pro will be powered by an M4 chip. It will use a new display tech called Tandem OLED, which layers two OLED panels on top of each other to provide richer colors and deeper blacks. The iPad Air is now available in 11 inches and 13 inches. The Apple Pencil Pro features a new squeeze gesture and supports rotation. The new Magic Keyboard, which is only compatible with the iPad Pro, features a larger trackpad with haptic feedback as well as a row of function keys.", "tag": [], "date": "2024-05-08"}
{"title": "Base Power Company (78 minute read)", "link": "https://www.notboring.co/p/base-power-company?utm_source=tldrnewsletter", "description": "The power industry is bottlenecked by the grid - adding more renewables and electrifying more things will only make the grid less stable. The grid is buckling due to the increasing use of variable sources of electricity, decreasing grid reliability, increasing delays in building electrical infrastructure, and increasing demand for electricity. The Base Power Company is trying to fix this problem by deploying connected batteries across the grid. These batteries will store energy for use when needed, reducing strain on the grid.", "tag": [], "date": "2024-05-08"}
{"title": "Some cases of Alzheimer's caused by two copies of a single gene (5 minute read)", "link": "https://www.nbcnews.com/health/aging/cases-alzheimers-caused-two-copies-single-gene-rcna150909?utm_source=tldrnewsletter", "description": "Researchers have identified a genetic form of late-in-life Alzheimer's disease that occurs in people who inherit two copies of the APOE4 gene. The gene has been associated with the disease as a risk factor for Alzheimer's for years. A recent study suggests that having two copies of the gene is an underlying cause of Alzheimer's rather than just a risk factor. An estimated 15% of Alzheimer's patients carry two copies of APOE4. The gene can make symptoms begin seven to 10 years sooner than in other adults, but it also makes patients more prone to the dangerous side effects of some drug treatments. The discovery allows researchers to develop gene therapy or drugs specifically targeting the gene.", "tag": [], "date": "2024-05-08"}
{"title": "Deniable Encryption (27 minute read)", "link": "https://ayende.com/blog/200993-C/deniable-encryption?utm_source=tldrnewsletter", "description": "Deniable encryption is a concept where messages are encrypted in such a way that using a different key would reveal a different message. Theoretically, it allows people to reveal their keys without spilling their secrets. This blog post proposes a method for building a deniable encryption scheme that allows multiple passwords and messages. The full code for the method is provided.", "tag": [], "date": "2024-05-08"}
{"title": "Headless UI v2.0 for React (8 minute read)", "link": "https://tailwindcss.com/blog/headless-ui-v2?utm_source=tldrnewsletter", "description": "Headless UI v2.0 for React features built-in anchor positioning, a new checkbox component, HTML form components, combobox list virtualization, a new website, improved docs, and improved hover, focus, and active state detection. The improvements are aimed at helping developers write less code and making the developer experience even better. This article details the most interesting new improvements. An upgrade guide is available for those transitioning from v1.x.", "tag": [], "date": "2024-05-08"}
{"title": "We've been put in the vibe space (6 minute read)", "link": "https://vickiboykis.com/2024/05/06/weve-been-put-in-the-vibe-space/?utm_source=tldrnewsletter", "description": "Search and recommendation have traditionally been kept separate, because while they occupy opposite ends of the same spectrum conceptually, they have different tooling, architectures, and machine learning goals. Large language models introduce expectations that need to be managed carefully because it is hard to guide customer intent in an open-ended solution space. This may be frustrating for consumers until specific LLM use cases are sorted out and made less general.", "tag": [], "date": "2024-05-08"}
{"title": "LPCAMM2 Is Finally Here, and It's a Big Deal (7 minute read)", "link": "https://www.ifixit.com/News/95078/lpcamm2-memory-is-finally-here?utm_source=tldrnewsletter", "description": "LPCAMM2 is a totally modular, repairable, and upgradeable memory standard for laptops. It allows consumers to buy laptops and then install more RAM as needed. LPCAMM2 supports the latest LPDDR chips for maximum speed and efficiency. This article presents a teardown of Lenovo's ThinkPad P1 (Gen 7), the first laptop to support LPCAMM2 technology. While the technology is arriving initially in a Lenovo product, it owes its existence to an alliance of tech companies working together over the course of several years.", "tag": [], "date": "2024-05-08"}
{"title": "Switch 2 will be revealed before April 2025, promises Nintendo (2 minute read)", "link": "https://www.theverge.com/2024/5/7/24150891/nintendo-switch-2-console-announcement-earnings-q4-2024?utm_source=tldrnewsletter", "description": "Nintendo's President has stated that a next-generation Switch console will be announced within this fiscal year.", "tag": [], "date": "2024-05-08"}
{"title": "Engineers use ultrasonic reactor to make cold brew coffee in under 3 minutes (2 minute read)", "link": "https://boingboing.net/2024/05/07/engineers-use-ultrasonic-reactor-to-make-cold-brew-coffee-in-under-3-minutes.html?utm_source=tldrnewsletter", "description": "The ultrasonic reactor delivers sound frequencies of 38.8 kHz, generating cavitation bubbles that explosively fracture coffee grounds, accelerating extraction.", "tag": [], "date": "2024-05-08"}
{"title": "Storage Churn (6 minute read)", "link": "https://www.tbray.org/ongoing/When/202x/2024/05/05/On-Storage?utm_source=tldrnewsletter", "description": "We're entering a period of churn where there will be serious competition on storage price and performance.", "tag": [], "date": "2024-05-08"}
{"title": "Lix (3 minute read)", "link": "https://lix.systems/about/#why-lix?utm_source=tldrnewsletter", "description": "Lix is an implementation of the Nix functional package management language designed to allow evolution of the language and tooling so that developers can improve usability and ergonomics without sacrificing correctness.", "tag": [], "date": "2024-05-08"}
{"title": "How novelty effects and Dopamine Culture rule the tech industry (10 minute read)", "link": "https://andrewchen.substack.com/p/how-novelty-effects-and-dopamine?utm_source=tldrnewsletter", "description": "Dopamine Culture is the result of everything becoming more accessible and universal - people have access to an endless variety of choice from their handheld devices.", "tag": [], "date": "2024-05-08"}
{"title": "A 100x speedup with unsafe Python (20 minute read)", "link": "https://yosefk.com/blog/a-100x-speedup-with-unsafe-python.html?utm_source=tldrnewsletter", "description": "A good way to make Python code fast is by using C libraries in the right ways.", "tag": [], "date": "2024-05-08"}
