{"title": "Auth0 by Okta is FREE for eligible startups 🚀 (Sponsor)", "link": "https://auth0.com/startups/tldr", "description": "Auth0 for Startups covers everything you want to do today, and everything you'll need tomorrow — from creating a seamless login experience with SSO to securely managing individual and business customers.", "tag": [], "date": "2024-07-22"}
{"title": "How a software update from cyber firm CrowdStrike caused one of the world's biggest IT blackouts (5 minute read)", "link": "https://www.cnbc.com/2024/07/19/what-is-crowdstrike-crwd-and-how-did-it-cause-global-it-outages.html?utm_source=tldrnewsletter", "description": "A fault with an update issued by CrowdStrike led to worldwide outages on Friday. CrowdStrike is a cybersecurity vendor that develops software to help companies detect and block hacks. It uses cloud technology to apply cyber protections to internet connected devices. The software requires deep access to systems to scan for threats. A fix has been issued, but it could be hard to implement - engineers will have to go into each individual data center running Windows to apply the fix, entering complex encryption keys manually for encrypted machines.", "tag": [], "date": "2024-07-22"}
{"title": "Google wants to steal Ray-Ban maker from Meta for Gemini smart glasses (2 minute read)", "link": "https://www.androidauthority.com/google-steal-ray-ban-meta-maker-gemini-glasses-3462619/?utm_source=tldrnewsletter", "description": "Google has approached Ray-Ban maker EssilorLuxottica about putting its Gemini assistant on future smart glasses. Meta was recently in advanced talks with EssilorLuxottica about acquiring a five percent stake in the company. It is unlikely that Meta will lose its partnership with EssilorLuxottica to Google. Google is developing an XR platform and has partnered with Samsung and Qualcomm for a device. It previously partnered with Luxottica prior to its merger with Essilor to make Google Glass.", "tag": [], "date": "2024-07-22"}
{"title": "Accidentally exposed yellowish-green crystals reveal ‘mind-blowing' finding on Mars, scientists say (9 minute read)", "link": "https://www.cnn.com/2024/07/20/science/nasa-curiosity-rover-mars-sulfur-rocks/index.html?utm_source=tldrnewsletter", "description": "The Curiosity rover has discovered rocks made of pure sulfur. The discovery was made by accident after the 1-ton rover drove over a rock and cracked it open, revealing yellowish-green crystals. On Earth, pure elemental sulfur is mostly found in places like hydrothermal vents. The rock was discovered in an area that was likely formed due to violent water flows and landslides. Curiosity is still in great health after 12 years of service.", "tag": [], "date": "2024-07-22"}
{"title": "Complete recycle of solid-state batteries possible, thanks to polymer layers (5 minute read)", "link": "https://interestingengineering.com/energy/recycle-solid-state-lithium-batteries?utm_source=tldrnewsletter", "description": "Solid-state lithium batteries are stable, have a higher energy density, and are much safer than conventional lithium-ion batteries, but they are more difficult to recycle. New research has revealed a practical and efficient way to recycle solid-state batteries. The process results in recycled batteries with over 92 percent of the discharge capacity of the original battery. The research demonstrates that it is possible to recycle solid-state batteries and harness their potential without harming the environment.", "tag": [], "date": "2024-07-22"}
{"title": "AWS + Datadog guide to align your cloud strategy with the Well-Architected framework (Sponsor)", "link": "https://www.datadoghq.com/resources/cloud-excellence-aws-well-architected/?utm_source=tldrnewsletter&amp;utm_medium=newsletter&amp;utm_campaign=dg-coreplatform-ww-aws-cloud-modernization-tldr", "description": "The AWS Well-Architected framework can help you build ", "tag": [], "date": "2024-07-22"}
{"title": "Let's blame the dev who pressed \"Deploy\" (6 minute read)", "link": "https://yieldcode.blog/post/lets-blame-the-dev-who-pressed-deploy/?utm_source=tldrnewsletter", "description": "Software developers are often incorrectly held responsible for bugs and outages. The people responsible for these incidents are those who put pressure on software engineers: CEOs, customers, regulators, and other parties in positions of power. Other professionals, such as anesthesiologists or structural engineers, are given the respect they deserve and thus can take responsibility for their work. People ignore software engineers, resulting in broken organizational practices.", "tag": [], "date": "2024-07-22"}
{"title": "Concerns about passkeys (4 minute read)", "link": "https://me.micahrl.com/blog/concerns-about-passkeys/?utm_source=tldrnewsletter", "description": "Passkeys are a technically interesting idea with many upsides, but they take away power from the user. This article discusses some of the issues with the technology. Passkeys can't be exported, sites can discriminate on which apps and devices passkeys can be stored on, and they rely on more centralized systems. It's bad for society if only vetted and authorized entities can build passkey apps and it's bad for users if they can't choose to use a particular passkey app.", "tag": [], "date": "2024-07-22"}
{"title": "AI paid for by Ads – the gpt-4o mini inflection point (4 minute read)", "link": "https://batchmon.com/blog/ai-cheaper-than-ads/?utm_source=tldrnewsletter", "description": "With OpenAI's recent introduction of GPT-4o mini, it's now possible to build dynamic, AI-generated content entirely supported by ads. Google's AdSense pays approximately $0.0026 per page view. A site could generate results tailored to user search queries and earn a profit after calculating for the cost of the generated content. This post presents a simple example of how this could be done with calculations of how much it would cost/profit.", "tag": [], "date": "2024-07-22"}
{"title": "Inside the fight over California's new AI bill (6 minute read)", "link": "https://www.vox.com/future-perfect/361562/california-ai-bill-scott-wiener-sb-1047?utm_source=tldrnewsletter", "description": "California state Senator Scott Wiener's Safe and Secure Innovation for Frontier Artificial Intelligence Models bill requires companies training 'frontier models' that cost more than $100 million to do safety testing and be able to shut off their models in the event of a safety incident. The bill has received heavy criticism from the tech industry. It will affect everyone who does business in California, not just companies that develop their models in California. This article contains an interview with Wiener about the bill and its critics.", "tag": [], "date": "2024-07-22"}
{"title": "Made by Google 2024: Pixel 9, Gemini, a new foldable and other things to expect from the event (9 minute read)", "link": "https://techcrunch.com/2024/07/21/made-by-google-2024-pixel-9-gemini-a-new-foldable-and-other-things-to-expect-from-the-event/?utm_source=tldrnewsletter", "description": "Google's Made By Google hardware event is set for August 13 at 10 am PT.", "tag": [], "date": "2024-07-22"}
{"title": "The rise and fall of software developer jobs (1 minute read)", "link": "https://www.axios.com/2024/07/18/rise-and-fall-of-software-developer-jobs?utm_source=tldrnewsletter", "description": "Demand for software developers has plunged in the last couple of years.", "tag": [], "date": "2024-07-22"}
{"title": "AMD says its new laptop chips can beat Apple — but still has to prove it (10 minute read)", "link": "https://www.theverge.com/2024/7/19/24198605/amd-ryzen-ai-strix-point-vs-apple-intel-qualcomm-event?utm_source=tldrnewsletter", "description": "AMD claims that its new Ryzen chip exceeds the performance of the MacBook Air in multitasking, image processing, 3D rendering, and gaming.", "tag": [], "date": "2024-07-22"}
{"title": "RenderCV (GitHub Repo)", "link": "https://github.com/sinaatalay/rendercv?utm_source=tldrnewsletter", "description": "Render CV creates high-quality PDF CVs from YAML input files.", "tag": [], "date": "2024-07-22"}
{"title": "💡 Great minds think a lot (Sponsor)", "link": "https://brilliant.org/tldrtech/?utm_source=tldrnewsletter", "description": "Become a learning machine with ", "tag": [], "date": "2024-07-22"}
{"title": "Samsung going all in on Google Messages in US, stops pre-installing Samsung Messages on Galaxy phones (2 minute read)", "link": "https://9to5google.com/2024/07/20/samsung-google-messages-no-longer-pre-installing/?utm_source=tldrnewsletter", "description": "Samsung Messages will no longer be pre-installed on Galaxy phones in favor of Google Messages starting with the Galaxy Z Fold 6 and Flip 6.", "tag": [], "date": "2024-07-22"}
{"title": "Elon Musk's X tests letting users request Community Notes on bad posts (7 minute read)", "link": "https://arstechnica.com/tech-policy/2024/07/elon-musks-x-finally-allows-users-to-request-fact-checks-on-misleading-posts/?utm_source=tldrnewsletter", "description": "X has launched a pilot test on the web-based version of its platform that allows users to request Community Notes to clarify problematic posts.", "tag": [], "date": "2024-07-22"}
