{"title": "Reach your career goals with an online degree from Southern New Hampshire University (Sponsor)", "link": "https://degrees.snhu.edu/?utm_source=TLDR&amp;utm_medium=PPL&amp;utm_campaign=PROS_Email&amp;utm_content=TLDR-Gen&amp;snhu_segment=OL", "description": "A high-quality education shouldn't cost an arm and a leg. And it doesn't at Southern New Hampshire University.", "tag": [], "date": "2024-07-19"}
{"title": "OpenAI debuts mini version of its most powerful model yet (2 minute read)", "link": "https://www.cnbc.com/2024/07/18/openai-4o-mini-model-announced.html?utm_source=tldrnewsletter", "description": "OpenAI has launched a new AI model called GPT-4o mini. It is available to free users. The 'o' in the name stands for 'omni', hinting at the model's audio, video, and text capabilities. The model will be made available to ChatGPT Enterprise users next week.", "tag": [], "date": "2024-07-19"}
{"title": "Amazon Prime Day drives U.S. online sales to record $14.2 billion (2 minute read)", "link": "https://www.cnbc.com/2024/07/18/amazon-prime-day-us-online-sales-climb-to-record-14point2-billion.html?utm_source=tldrnewsletter", "description": "Online spending during this year's 48-hour Amazon Prime Day event was up 11% year-over-year, with customers spending $14.2 billion. The strong showing was driven by back-to-school shopping and an apparent product refresh cycle. Consumer behaviors during the sale indicate a shift to more conscious shopping and a preference for saving over splurging.", "tag": [], "date": "2024-07-19"}
{"title": "WHAM! Nuclear fusion experiment hits new record for magnet strength (4 minute read)", "link": "https://techcrunch.com/2024/07/18/wham-nuclear-fusion-experiment-hits-new-record-for-magnet-strength/?utm_source=tldrnewsletter", "description": "A new fusion experiment has set a record for the strongest steady magnetic field confining a plasma. Strong magnets are essential for certain types of fusion power - for every doubling of the strength of a magnetic field, the power output of one reactor design increases 16-fold. The team was able to produce a 17 tesla magnetic field, more than twice as powerful as the high-resolution MRI scanners used to image human brains. They are now working on more advanced magnet designs.", "tag": [], "date": "2024-07-19"}
{"title": "A scientist took a psychedelic drug — and watched his own brain 'fall apart' (5 minute read)", "link": "https://www.npr.org/sections/shots-health-news/2024/07/18/g-s1-11501/psilocybin-psychedelic-drug-brain-plasticity-depression-addiction?utm_source=tldrnewsletter", "description": "A study on psilocybin suggests that psychedelic drugs work by disrupting certain brain networks, especially one that helps people form a sense of space, time, and self. The study, which involved scanning participants' brains with an MRI while under the influence of the drug, showed that the drug caused populations of neurons usually in synchrony to fall out of synchrony. The brain appears to respond to this by entering a state of enhanced plasticity that can last for weeks. The study hints at how psychedelic drugs could be used to treat people with addiction, depression, or post-traumatic stress.", "tag": [], "date": "2024-07-19"}
{"title": "Gotchas with SQLite in Production (8 minute read)", "link": "https://blog.pecar.me/sqlite-prod?utm_source=tldrnewsletter", "description": "SQLite provides lower operational complexity. It is the best choice for getting applications running on a single machine. However, SQLite becomes less appealing if a project requires multiple machines, has a write-heavy workload, or has long-running transactions. In these cases, developers are better off using a more traditional database like MySQL or Postgres.", "tag": [], "date": "2024-07-19"}
{"title": "This ad slot reaching TLDR subscribers could be yours (Sponsor)", "link": "https://advertise.tldr.tech/?utm_source=tldr&amp;utm_medium=newsletter&amp;utm_campaign=secondary07192024", "description": "If you're looking to get in front of a highly engaged tech audience including software developers, product managers, founders and executives, consider advertising in TLDR. We have 10 newsletters to choose from and a subscriber base of 4+ million tech professionals to effectively reach your target audience. ", "tag": [], "date": "2024-07-19"}
{"title": "Python grapples with Apple App Store rejections (7 minute read)", "link": "https://lwn.net/Articles/979671/?utm_source=tldrnewsletter", "description": "Apple's macOS App Store is automatically rejecting apps that contain the string 'itms-services' - the URL scheme for apps to ask Apple's iTunes Store to install another app. The string exists in the urllib parser in Python's standard library. The discovery of this issue led to a discussion among Python developers about whether 'acceptable to app stores' should be a design goal for CPython. The developers decided to implement a `--with-app-store-compliance` configuration option to remove the problematic code.", "tag": [], "date": "2024-07-19"}
{"title": "Apple TV+ will soon get a lot more movies made by studios other than Apple (2 minute read)", "link": "https://arstechnica.com/gadgets/2024/07/apple-is-in-talks-with-hollywood-studios-to-bring-more-classic-movies-to-tv/?utm_source=tldrnewsletter", "description": "Apple is in talks with major studios to bring more movies to Apple TV+, expanding and extending the service's appeal. The company's previous experiments with licensing movies and making them available for limited runs seem to have gone well. While Apple has found some success in terms of series, it has struggled to make as much of an impact with its movies. Apple TV+ accounted for $23.9 billion, more than half the revenue generated by iPhone hardware sales, in the second quarter of this year.", "tag": [], "date": "2024-07-19"}
{"title": "Meta Reportedly Unhappy With How Much Money Its VR Division Burns (3 minute read)", "link": "https://gizmodo.com/meta-reportedly-unhappy-with-how-much-money-its-vr-division-burns-2000476495?utm_source=tldrnewsletter", "description": "Meta has told its AR/VR teams to cut spending by around 20%. The division has lost $55 billion since 2019. The company is still aiming to release a new Meta Quest 4 headset, a Quest Pro sequel, and new AR glasses in the next three years. Meta has been shifting its focus over to AI. It is gearing up to release its Llama 400B AI model by the end of the month.", "tag": [], "date": "2024-07-19"}
{"title": "Google's goo․gl links will stop working in August 2025 (2 minute read)", "link": "https://9to5google.com/2024/07/18/googl-links/?utm_source=tldrnewsletter", "description": "Google stopped generating new goo.gl URLs in March 2019.", "tag": [], "date": "2024-07-19"}
{"title": "How to Be (Reasonably) Hard on Yourself (6 minute read)", "link": "https://blog.nateliason.com/p/reasonably-hard-on-yourself?utm_source=tldrnewsletter", "description": "Being uncritical of your work can lead to mediocrity, but being obsessively self-critical can lead to disastrous consequences.", "tag": [], "date": "2024-07-19"}
{"title": "Netflix is kicking US subscribers off its cheapest ad-free plan soon (3 minute read)", "link": "https://arstechnica.com/gadgets/2024/07/netflix-is-kicking-us-subscribers-off-its-cheapest-ad-free-plan-soon/?utm_source=tldrnewsletter", "description": "Netflix is starting to phase out its ad-free Basic plan in the US and France, making the cheapest commercial-free Netflix plan $15.49 per month in the US.", "tag": [], "date": "2024-07-19"}
{"title": "How a Single Line of Code Brought Down a Billion Dollar Rocket (11 minute read)", "link": "https://newsletter.techworld-with-milan.com/p/how-a-single-line-of-code-brought?utm_source=tldrnewsletter", "description": "A software flaw in Ariane 5's guidance system caused the rocket to deviate off track, causing one of history's most expensive software failures.", "tag": [], "date": "2024-07-19"}
{"title": "Modern Luddites: On Being a Digital Minimalist Family in a Tech-Saturated World (14 minute read)", "link": "https://www.afterbabel.com/p/modern-luddites-on-being-a-digital?utm_source=tldrnewsletter", "description": "Childhood is a precious, fleeting stage of life - screens obstruct imagination and play opportunities, so some parents choose to not rely on them at all.", "tag": [], "date": "2024-07-19"}
{"title": "Broadcom Gains on Report That It's Discussing Chip With OpenAI (2 minute read)", "link": "https://www.bloomberg.com/news/articles/2024-07-18/broadcom-gains-on-report-that-it-s-discussing-chip-with-openai?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTcyMTM0NzQ4MiwiZXhwIjoxNzIxOTUyMjgyLCJhcnRpY2xlSWQiOiJTR1U0NThEV1JHRzAwMCIsImJjb25uZWN0SWQiOiJFQTExNDNDNTM4NEE0RUY5QTg5RjJEN0IxMTg2MzcwOSJ9.JFOLpDlLLB4le75avbm_VYGxJMfnbxGNKj6AC7BECBI&amp;utm_source=tldrnewsletter", "description": "Broadcom is reportedly in discussions with OpenAI about creating an artificial intelligence chip, an effort that will involve OpenAI hiring former Google employees who worked on the Tensor processor.", "tag": [], "date": "2024-07-19"}
