{"title": "What will OpenAI announce Monday? Quite possibly an AI voice assistant (4 minute read)", "link": "https://mashable.com/article/openai-announcement-monday-voice-assistant?utm_source=tldrnewsletter", "description": "OpenAI's big announcement today may be a voice assistant. The company is reportedly working on a technology that rolls audio, text, and image recognition into one product. OpenAI will be holding a livestream at 10 am PT to announce the product. Google is expected to announce updates to Gemini at its developer conference tomorrow.", "tag": [], "date": "2024-05-13"}
{"title": "Apple, Netflix, and Amazon Want to Change How They Pay Hollywood Stars (12 minute read)", "link": "https://www.bloomberg.com/news/newsletters/2024-05-12/apple-netflix-amazon-want-to-change-how-they-pay-hollywood-stars?srnd=technology-vp&amp;utm_source=tldrnewsletter", "description": "Apple will soon begin basing pay on how a series or movie performs. Talent would receive bonuses on a points system, with the size of the bonuses being based on the number of people who signed up for Apple TV+ to watch, how much time they spent viewing, and the cost of the program relative to the size of its audience. Netflix and Amazon have also spent months developing plans for performance-based compensation, but neither have gone public yet with their models. Streaming services are becoming increasingly more transparent - the practice will make it easier to tie pay to performance.", "tag": [], "date": "2024-05-13"}
{"title": "Commercial Space Stations Approach Launch Phase (3 minute read)", "link": "https://spectrum.ieee.org/space-station-orbital-reef?utm_source=tldrnewsletter", "description": "A number of private-sector companies are aiming to harbor commercial activities in low Earth orbit (LEO) as the International Space Station approaches its end of service. This article discusses the various projects, with a focus on Blue Origin's Orbital Reef program, which recently aced testing milestones for its critical life support system with assistance from NASA. Orbital Reef plans to build a space habitat with NASA as a main client starting out, with a wider goal of fostering a sustainable commercial presence in LEO. The initiative is backed by NASA's Commercial LEO Destinations program, which is providing funding to encourage the private sector to build space habitats.", "tag": [], "date": "2024-05-13"}
{"title": "'Tungsten wall' leads to nuclear fusion breakthrough (4 minute read)", "link": "https://qz.com/new-fusion-record-achieved-tungsten-encased-reactor-1851459488?utm_source=tldrnewsletter", "description": "Encasing fusion plasma inside tungsten allowed a tokamak in France to set a new record by sustaining plasma at about 50 million degrees Celsius for six minutes. Tungsten has an extraordinarily high melting point. Using a tungsten-wall environment is for more challenging than using carbon, but the material allows physicists to sustain hot plasmas for longer and at higher energies and densities. While research into nuclear fusion has been slow, the field has made significant strides over the last few years.", "tag": [], "date": "2024-05-13"}
{"title": "Popover API (6 minute read)", "link": "https://developer.mozilla.org/en-US/docs/Web/API/Popover_API?utm_source=tldrnewsletter", "description": "The Popover API allows developers to easily display popover content on top of other page content. It has a standard, consistent, and flexible mechanism that creates popover content that can be controlled declaratively using HTML attributes or via JavaScript. This documentation covers how to use the Popover API with examples.", "tag": [], "date": "2024-05-13"}
{"title": "Avoiding the soft delete anti-pattern (8 minute read)", "link": "https://www.cultured.systems/2024/04/24/Soft-delete/?utm_source=tldrnewsletter", "description": "Programmers hate deleting things, leading people to advocate for soft deletion, where instead of really deleting a record, you add a field that marks the record as deleted. This is generally a bad idea and there are a number of better ways to ensure access to old data. This article discusses why soft deletion is a problem and discusses several alternatives that may better meet the needs of developers.", "tag": [], "date": "2024-05-13"}
{"title": "Analyst on Starlink's rapid rise: “Nothing short of mind-blowing” (7 minute read)", "link": "https://arstechnica.com/space/2024/05/just-5-years-after-its-first-launch-the-starlink-constellation-is-profitable/?utm_source=tldrnewsletter", "description": "SpaceX's Starlink satellite Internet business is now profitable. The company's first batch of 60 satellites was launched just five years ago. It will have an estimated free cash flow of about $600 million this year. The business is now self-sustaining and there's still room for significant growth.", "tag": [], "date": "2024-05-13"}
{"title": "An Ode To Early Employees (9 minute read)", "link": "https://threadreaderapp.com/thread/1788684269902057811.html?utm_source=tldrnewsletter", "description": "Being a founder used to be a fancy way of saying 'unemployed'. The environment was very different back in the 90s, so those who had the courage to start something were celebrated once they succeeded. Founders today are still treated as if in a class of their own, but things are very different. Virtually any founder can raise millions of dollars before there's a product or revenue, and creating a prototype has never been easier. This article discusses how things have changed and how that has affected both founders and their employees. It also provides suggestions on how founders can start building trusting relationships and celebrate those who help enable their companies in their earliest days.", "tag": [], "date": "2024-05-13"}
{"title": "Lessons learned reinventing the Python notebook (14 minute read)", "link": "https://marimo.io/blog/lessons-learned?utm_source=tldrnewsletter", "description": "Prefer simplicity, design for extensibility, and stay true to your project's pillars.", "tag": [], "date": "2024-05-13"}
{"title": "superfile (GitHub Repo)", "link": "https://github.com/MHNightCat/superfile?utm_source=tldrnewsletter", "description": "superfile is a modern terminal file manager.", "tag": [], "date": "2024-05-13"}
{"title": "Waymo says its robotaxis are now making 50,000 paid trips every week (3 minute read)", "link": "https://www.engadget.com/waymo-says-its-robotaxis-are-now-making-50000-paid-trips-every-week-130005096.html?utm_source=tldrnewsletter", "description": "Waymo has had over one million rider-only trips across four cities.", "tag": [], "date": "2024-05-13"}
{"title": "How To Price A Data Asset (30 minute read)", "link": "https://pivotal.substack.com/p/how-to-price-a-data-asset?utm_source=tldrnewsletter", "description": "The value of data comes from the value of what can be done with it - every discussion of price has to begin with understanding how the data will be used and by whom.", "tag": [], "date": "2024-05-13"}
{"title": "Is dark matter's main rival theory dead? There's bad news from the Cassini spacecraft and other recent tests (6 minute read)", "link": "https://theconversation.com/is-dark-matters-main-rival-theory-dead-theres-bad-news-from-the-cassini-spacecraft-and-other-recent-tests-228826?utm_source=tldrnewsletter", "description": "Recent data suggests that Mond, as presently formulated, is no longer a viable alternative to dark matter.", "tag": [], "date": "2024-05-13"}
{"title": "GPUs Go Brrr (26 minute read)", "link": "https://hazyresearch.stanford.edu/blog/2024-05-12-tk?utm_source=tldrnewsletter", "description": "This post looks at what a team at Stanford learned by making GPUs run more efficiently and how what they learned has changed the way they think about AI compute.", "tag": [], "date": "2024-05-13"}
