{"title": "Tesla to lay off everyone working on Superchargers, new vehicles (3 minute read)", "link": "https://arstechnica.com/cars/2024/04/tesla-to-lay-off-everyone-working-on-superchargers-new-vehicles/?utm_source=tldrnewsletter", "description": "Tesla is laying off its director of EV charging Rebecca Tinucci, the head of new vehicle development Daniel Ho, as well as the teams that operated under the two executives. These layoffs are part of a larger effort by CEO Elon Musk to reduce costs and headcount within the company. Tesla plans to continue building out some new Supercharger locations and finish those currently under construction. Musk is also dissolving the company's public policy team in this latest cull.", "tag": [], "date": "2024-05-01"}
{"title": "Apple to unveil AI-enabled Safari browser alongside new operating systems (7 minute read)", "link": "https://appleinsider.com/articles/24/04/30/apple-to-unveil-ai-enabled-safari-browser-alongside-new-operating-systems?utm_source=tldrnewsletter", "description": "Apple is testing a version of its Safari web browser that includes an AI-powered tool called Intelligent Search. Intelligent Search leverages Apple's on-device AI technology to identify topics and key phrases within a web page to create summaries. The exact implementation of the feature is still unknown. The new Safari will also have a feature called Web Eraser that will allow users to remove specific portions of web pages. Apple is working on a powerful visual search feature that will allow users to obtain information on consumer products when browsing through images, scheduled for integration sometime in 2025.", "tag": [], "date": "2024-05-01"}
{"title": "Portal Space Systems unveils Supernova, an ultra-mobile spacecraft (4 minute read)", "link": "https://techcrunch.com/2024/04/30/portal-space-systems-unveils-supernova-an-ultra-mobile-spacecraft/?utm_source=tldrnewsletter", "description": "Portal Space Systems' ultra-mobile Supernova satellite bus could propel transfers from low Earth orbit to geostationary orbit in a matter of hours. The 500 kg vehicle is designed to be payload agnostic and survive in orbit for at least five years while being continuously maneuvered. It uses a solar-thermal propulsion system that produces a delta-V of 6 kilometers per second. Portal aims to conduct an in-flight demonstration in late 2025 or early 2026. It is looking to scale up its team and grow manufacturing to support the production of multiple spacecraft per year.", "tag": [], "date": "2024-05-01"}
{"title": "Enzymes open new path to universal donor blood (5 minute read)", "link": "https://www.dtu.dk/english/newsarchive/2024/04/enzymes-open-new-path-to-universal-donor-blood?utm_source=tldrnewsletter", "description": "Researchers have discovered enzymes that are able to remove specific sugars that make up the A and B antigens in the human ABO blood groups when mixed with medicine blood cells. The researchers are close to being able to produce universal blood from group B donors, but there is still more work to be done to convert the more complex group A blood type. There is now a higher need for donor blood due to a larger proportion of the population being elderly and more patients undergoing blood-intensive medical procedures. Successfully converting A or B blood types into universal donor blood would markedly reduce the logistics and costs currently associated with storing four different blood types and increase the supply of donor blood by reducing waste.", "tag": [], "date": "2024-05-01"}
{"title": "The Borgo Programming Language (GitHub Repo)", "link": "https://github.com/borgo-lang/borgo#readme?utm_source=tldrnewsletter", "description": "Borgo is a statically typed language that compiles to Go. It is more expressive than Go but less complex than Rust. Borgo's syntax is similar to Rust but with optional semicolons. It is fully compatible with existing Go packages. An online playground that provides a tour of the language is available.", "tag": [], "date": "2024-05-01"}
{"title": "\"run0\" as a sudo replacement (30 minute read)", "link": "https://lwn.net/Articles/971745/?utm_source=tldrnewsletter", "description": "run0 is a sudo replacement that will be part of the upcoming systemd 256 release. It avoids the use of setuid permissions entirely. Using setuid permissions results in an execution context for privileged code that is half under the control of unprivileged code and needs careful manual cleanup. This page contains the Mastodon stream that discusses replacing sudo with run0.", "tag": [], "date": "2024-05-01"}
{"title": "🇪🇺 Dear Europe, please wake up – eu/acc (13 minute read)", "link": "https://klinger.io/posts/eu-acc?utm_source=tldrnewsletter", "description": "The lack of startups in Europe isn't due to taxes or mentality, it's because of friction. Startups need early acceleration to become successful - more friction will mean competitors have a better chance of winning. The EU needs a system similar to the US where Delaware is the de facto standard for legal entities for startups - there are currently too many legal systems to navigate. It also needs to take teaching English seriously as a lack of English ability limits communication and job opportunities.", "tag": [], "date": "2024-05-01"}
{"title": "Apple poaches AI experts from Google, creates secretive European AI lab (5 minute read)", "link": "https://arstechnica.com/ai/2024/04/apple-poaches-ai-experts-from-google-creates-secretive-european-ai-lab/?utm_source=tldrnewsletter", "description": "Apple's top AI team is made up of former key figures from Google. The company has bought about two dozen AI startups in the past decade. Apple is focusing on bringing on-device AI capabilities to the iPhone. The next iPhone could feature a voice-activated smart personal assistant that interacts with apps. More details about these AI features will likely be announced at Apple's Worldwide Developers Conference in June.", "tag": [], "date": "2024-05-01"}
{"title": "Binance founder Changpeng Zhao sentenced to four months in prison (3 minute read)", "link": "https://www.theverge.com/2024/4/30/24140638/binance-founder-changpeng-zhao-sentence-money-laundering?utm_source=tldrnewsletter", "description": "Binance founder Changpeng Zhao has been sentenced to four months in prison for failing to establish adequate anti-money laundering protections on the crypto exchange.", "tag": [], "date": "2024-05-01"}
{"title": "How an empty S3 bucket can make your AWS bill explode (4 minute read)", "link": "https://medium.com/@maciej.pocwierz/how-an-empty-s3-bucket-can-make-your-aws-bill-explode-934a383cb8b1?utm_source=tldrnewsletter", "description": "AWS S3 charges for unauthorized incoming requests - anyone who knows the name of any S3 bucket can ramp up its owner's AWS bill as they like.", "tag": [], "date": "2024-05-01"}
{"title": "The Browser Company releases Arc for Windows (3 minute read)", "link": "https://techcrunch.com/2024/04/30/the-browser-company-releases-arc-for-windows/?utm_source=tldrnewsletter", "description": "Arc for Windows is now available to all users without a waitlist.", "tag": [], "date": "2024-05-01"}
{"title": "Screenshots suggest TikTok is circumventing Apple App Store commissions (5 minute read)", "link": "https://techcrunch.com/2024/04/30/screenshots-suggest-tiktok-is-circumventing-apple-app-store-commissions/?utm_source=tldrnewsletter", "description": "TikTok is presenting some of its users with a link to its website to purchase coins used for tipping digital creators.", "tag": [], "date": "2024-05-01"}
{"title": "Apple must open iPadOS to sideloading within 6 months, EU says (2 minute read)", "link": "https://arstechnica.com/apple/2024/04/apple-must-open-ipados-to-sideloading-within-6-months-eu-says/?utm_source=tldrnewsletter", "description": "Apple's iPadOS is now classified as a gatekeeper under the EU's DMA, meaning it will soon be subject to the same regulations as the iPhone.", "tag": [], "date": "2024-05-01"}
{"title": "Why SQLite Uses Bytecode (13 minute read)", "link": "https://sqlite.org/draft/whybytecode.html?utm_source=tldrnewsletter", "description": "SQLite uses bytecode because bytecode is easier to understand and debug, smaller than the corresponding AST coming out of the parser, faster because fewer decisions need to be made for each computation, and can be run incrementally.", "tag": [], "date": "2024-05-01"}
