{"title": "New TLDR newsletter in your inbox is great, but what about those spammers filling it up with junk? (Sponsor)", "link": "https://get.incogni.io/aff_c?offer_id=1151&amp;aff_id=16286", "description": "Spam doesn't end with emails—it's also pushed to the limit with robocalls, targeted ads, and your data exposed to anyone with a couple of bucks to spare.", "tag": [], "date": "2024-08-16"}
{"title": "Google's AI Search Gives Sites Dire Choice: Share Data or Die (12 minute read)", "link": "https://www.bloomberg.com/news/articles/2024-08-15/google-s-search-dominance-leaves-sites-little-choice-on-ai-scraping?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTcyMzc2OTM4NywiZXhwIjoxNzI0Mzc0MTg3LCJhcnRpY2xlSWQiOiJTSTlHNEREV0xVNjgwMCIsImJjb25uZWN0SWQiOiJFQTExNDNDNTM4NEE0RUY5QTg5RjJEN0IxMTg2MzcwOSJ9.wOvq4COeCKavu92a7vyYepRKmTb4QRZBt5wVz09nvQI&amp;utm_source=tldrnewsletter", "description": "The tool Google uses to sift through web content to come up with AI answers is the same one that keeps track of web pages for search results. Sites that block Google's AI bot may not show up in search. Publishers either have to choose to offer up their content for use by AI models, which could make their sites obsolete, or disappear from Google search, a top source of traffic. Google has signaled to publishers it is not interested in negotiating data-sharing deals and media companies have little leverage in the situation.", "tag": [], "date": "2024-08-16"}
{"title": "Starlink Competitor AST Soars After Confirming Satellite Launch (3 minute read)", "link": "https://www.bloomberg.com/news/articles/2024-08-15/starlink-competitor-ast-soars-after-confirming-satellite-launch?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTcyMzc2OTM3MiwiZXhwIjoxNzI0Mzc0MTcyLCJhcnRpY2xlSWQiOiJTSUEwRFFEV1JHRzAwMCIsImJjb25uZWN0SWQiOiJFQTExNDNDNTM4NEE0RUY5QTg5RjJEN0IxMTg2MzcwOSJ9.xstXANIQZRPC1REh37avRI8XPAvgFzt2UM8dtCqp7ys&amp;utm_source=tldrnewsletter", "description": "AST SpaceMobile's market value closed at a record high of more than $8 billion after the satellite communication company confirmed an early September window for its inaugural commercial launch of a network in low-Earth orbit. The company is working with AT&T, Verizon, and other partners to provide wireless service from space to regular consumer smartphones. AST plans to use a SpaceX rocket to send its first five commercial satellites to orbit.", "tag": [], "date": "2024-08-16"}
{"title": "A.L.S. Stole His Voice. A.I. Retrieved It (14 minute read)", "link": "https://www.nytimes.com/2024/08/14/health/als-ai-brain-implants.html?unlocked_article_code=1.DU4.mn64.bFvgP77BpFAe&smid=url-share&utm_source=tldrnewsletter", "description": "A patient suffering from ALS received a surgical implant last July that connected his brain to a computer, allowing him to speak with the assistance of an AI-powered voice. The implant is able to recognize the words the patient is trying to speak and produce sounds that come close to matching his true voice. It has significantly improved the patient's life, allowing him to communicate with loved ones and express his needs to carers. It is unclear whether the implant would have the same effect on more severely paralyzed people - the patient's speech had deteriorated, but not disappeared.", "tag": [], "date": "2024-08-16"}
{"title": "NASA and Rocket Lab aim to prove we can go to Mars for 1/10 the price (6 minute read)", "link": "https://techcrunch.com/2024/08/15/nasa-and-rocket-lab-aim-to-prove-we-can-go-to-mars-for-1-10-the-price/?utm_source=tldrnewsletter", "description": "Two Rocket Lab-made spacecraft are almost ready to head to Mars. Their mission will be to study the interaction between solar winds and the Martian atmosphere. The mission is set to launch no earlier than October on the first launch of Blue Origin's New Glenn rocket. Getting to Mars has historically been very expensive - Rocket Lab's system is two orders of magnitude cheaper than everything else. This article details how Rocket Lab designed the spacecraft.", "tag": [], "date": "2024-08-16"}
{"title": "Onboarding to a 'legacy' codebase with the help of AI (19 minute read)", "link": "https://martinfowler.com/articles/exploring-gen-ai.html#memo-09?utm_source=tldrnewsletter", "description": "Generative AI can help us understand code better, particularly in large codebases. This is especially handy for older codebases that are getting hard to maintain and for onboarding. The author of this article attempted to use AI to help understand an issue in an open source project. While they didn't figure out how to solve the ticket, they learned a lot about what AI can and can't help with.", "tag": [], "date": "2024-08-16"}
{"title": "Font with Built-In Syntax Highlighting (14 minute read)", "link": "https://blog.glyphdrawing.club/font-with-built-in-syntax-highlighting/?utm_source=tldrnewsletter", "description": "This blog discusses how to implement syntax highlighting within a font. Using a font instead of a framework for syntax highlighting allows for an easier installation process and fewer dependencies. It also makes pages load faster, can work everywhere, and doesn't require maintenance or updating. While this method is not a direct replacement for more robust syntax highlighting libraries, it works well enough for simple needs.", "tag": [], "date": "2024-08-16"}
{"title": "Time to value is the only metric that matters when onboarding developers (Sponsor)", "link": "https://www.linkedin.com/posts/dan-ni_tldr-time-to-value-is-the-only-metric-that-activity-7229893104709853184-PVl9?utm_source=tldrnewsletter", "description": "This LinkedIn post describes how TLDR's founder hit a critical inflection point at his previous company, ScraperAPI, after discovering one key insight. They converted free users to paid users at 2x the rate so long as they managed to send at least one API call within 24 hours. Follow Dan for more dev marketing tips.", "tag": [], "date": "2024-08-16"}
{"title": "Ex-Google CEO says successful AI startups can steal IP and hire lawyers to ‘clean up the mess' (3 minute read)", "link": "https://www.theverge.com/2024/8/14/24220658/google-eric-schmidt-stanford-talk-ai-startups-openai?utm_source=tldrnewsletter", "description": "Ex-Google CEO Eric Schmidt advised students to create a clone TikTok app with copied resources if it was ever banned during a recent talk at Stanford when talking about a future world in which AI agents can do complex tasks on behalf of humans. The example was used to drive a point that Silicon Valley entrepreneurs should create things as fast as possible and use lawyers to clean the mess up if they become successful. He added that it doesn't matter if content is stolen if nobody is using the product. Schmidt reportedly requested the removal of the video of the talk, which has been taken down from YouTube.", "tag": [], "date": "2024-08-16"}
{"title": "New Geekbench AI benchmark can test the performance of CPUs, GPUs, and NPUs (4 minute read)", "link": "https://arstechnica.com/gadgets/2024/08/geekbench-ml-becomes-geekbench-ai-a-cross-platform-performance-test-for-npus-and-more/?utm_source=tldrnewsletter", "description": "Primate Labs has released Geekbench AI, an app designed to test CPUs, GPUs, and NPUs. In addition to measuring speed, the app also attempts to measure accuracy, which is important for learning workloads that rely on producing consistent outcomes. Geekbench AI supports several frameworks on Windows, macOS, Linux, iOS/iPadOS, and Android. It is free to use, but there is a Pro version that enables command-line tools, the ability to run benchmarks without uploading results to the Geekbench Browser, and a few other benefits.", "tag": [], "date": "2024-08-16"}
{"title": "Passkeys are not passwords (3 minute read)", "link": "https://notes.neatnik.net/2024/08/passkeys-are-not-passwords?utm_source=tldrnewsletter", "description": "A key requirement of passkeys is that they are unphishable - it is impossible for a person to provide passkey data to someone else.", "tag": [], "date": "2024-08-16"}
{"title": "Google Meet gets emoji reactions, filters, and mobile screen-sharing (2 minute read)", "link": "https://www.zdnet.com/article/google-meet-rolls-out-new-features-including-a-revamped-ui-and-on-the-go-mode/?utm_source=tldrnewsletter", "description": "Google Meet also has new AI-powered features, including the ability to summarize meetings and take notes.", "tag": [], "date": "2024-08-16"}
{"title": "Kardinal (GitHub Repo)", "link": "https://github.com/kurtosis-tech/kardinal?utm_source=tldrnewsletter", "description": "Kardinal is a framework for creating lightweight development environments within shared Kubernetes clusters.", "tag": [], "date": "2024-08-16"}
{"title": "Integration and Android (18 minute read)", "link": "https://stratechery.com/2024/integration-and-android/?utm_source=tldrnewsletter", "description": "Integration delivers a better user experience - forcing a divestiture of Android in particular would be a mistake.", "tag": [], "date": "2024-08-16"}
{"title": "Headless CMSs aren't enough (Sponsor)", "link": "https://www.builder.io/hub/ebooks/beyond-headless-ai-visual-development?utm_source=tldr-newsletter&amp;utm_campaign=visual-development-and-ai-ebook-q2&amp;utm_medium=email&amp;utm_content=ebook", "description": "AI and visual development are bridging the gap between idea to production - and they'll shape the future of A/B testing, personalization, and digital experiences. ", "tag": [], "date": "2024-08-16"}
{"title": "Google is a monopoly. The fix isn't obvious (5 minute read)", "link": "https://www.theregister.com/2024/08/15/google_monopoly_fix/?utm_source=tldrnewsletter", "description": "A poorly targeted remedy would just allow another predator to thrive.", "tag": [], "date": "2024-08-16"}
{"title": "It works on my machine. Why? (5 minute read)", "link": "https://thoughtbot.com/blog/it-works-on-my-machine-why?utm_source=tldrnewsletter", "description": "A checklist of things to investigate when something works just fine on your computer but not on someone else's.", "tag": [], "date": "2024-08-16"}
