{"title": "Sam Altman rejoins OpenAI board of directors as investigation into his ouster comes to a close (10 minute read)", "link": "https://www.cnbc.com/2024/03/08/sam-altman-rejoins-openai-board-company-adds-three-new-members.html?utm_source=tldrnewsletter", "description": "OpenAI has announced its new board with the wrap-up of an internal investigation into the events leading to Sam Altman's ouster. Sam Altman will rejoin OpenAI's board along with Dr. Sue Desmond-Hellmann, former CEO of the Bill and Melinda Gates Foundation; Nicole Seligman, former EVP and Global General Counsel of Sony and President of Sony Entertainment; Fidji Simo, CEO and Chair of Instacart; and current board members Adam D’Angelo, Larry Summers, and Bret Taylor. OpenAI will continue to expand the board moving forward.", "tag": [], "date": "2024-03-11"}
{"title": "Former Activision CEO Bobby Kotick Considering Buying TikTok (3 minute read)", "link": "https://www.pcmag.com/news/former-activision-ceo-bobby-kotick-considering-buying-tiktok?utm_source=tldrnewsletter", "description": "Former Activision CEO Bobby Kotick is considering buying TikTok - he recently floated the idea at a dinner with a group of potential partners. A proposed legislation may force ByteDance to sell TikTok or have it banned from the US. There are concerns that ByteDance may share data about its users with the Chinese government or use the platform to influence US citizens' political opinions. The bill will be voted on by the full House on Wednesday, after which it will move on to the Senate.", "tag": [], "date": "2024-03-11"}
{"title": "mRNA vaccines: let's be sick a whole lot less and maybe cure cancer (19 minute read)", "link": "https://bessstillman.substack.com/p/mrna-vaccines-lets-be-sick-a-whole?utm_source=tldrnewsletter", "description": "mRNA vaccines are our best bet at addressing viral persistence. They can prevent infection as well as improve responses against infection. They are also faster, cheaper, and more flexible to make than their traditional counterparts. mRNA vaccines are like injectable instructions that turn a body's cells into factories that can create any protein for which mRNA instructions can be built. This means they can be used to teach the body to mount an immune response to any target foreign protein - including proteins on cancer cells.", "tag": [], "date": "2024-03-11"}
{"title": "New Breakthrough Brings Matrix Multiplication Closer to Ideal (11 minute read)", "link": "https://www.quantamagazine.org/new-breakthrough-brings-matrix-multiplication-closer-to-ideal-20240307/?utm_source=tldrnewsletter", "description": "Three researchers from the University of California have presented a new technique that boosts matrix multiplication. Matrix multiplication is a fundamental computational operation that is incorporated into a large population of the algorithms people use every day for a variety of tasks. Even slight improvements can eventually lead to significant savings in time, computational power, and money. While the new technique has set new records, the most exciting thing about the development is that the technique reveals a new avenue for improvement that was previously unknown.", "tag": [], "date": "2024-03-11"}
{"title": "S3 is files, but not a filesystem (13 minute read)", "link": "https://calpaterson.com/s3.html?utm_source=tldrnewsletter", "description": "The idea that Amazon S3 is really an 'Amazon Cloud Filesystem' is a bit of a fiction - it isn't a file system and it can't stand in for one. S3 implements a completely different arrangement and its primitives are only partly compatible with the Unix file API. It has fewer functions and can't do some tasks, such as overwriting files partially. This means that filesystem software, especially databases, can't be ported to Amazon S3.", "tag": [], "date": "2024-03-11"}
{"title": "How We Bypassed Safari 17's Advanced Audio Fingerprinting Protection (22 minute read)", "link": "https://fingerprint.com/blog/bypassing-safari-17-audio-fingerprinting-protection/?utm_source=tldrnewsletter", "description": "Browsers can produce audio files that users can't hear. These audio files can be used to identify web visitors. Apple has decided to fight this type of identification in Safari 17, but so far its measures don't fully work. The new measures can be bypassed using a technique detailed in this article. A link to a post that explains how audio fingerprinting works is available.", "tag": [], "date": "2024-03-11"}
{"title": "Here is Claude 3's system prompt (2 minute read)", "link": "https://twitter.com/amandaaskell/status/1765207842993434880?utm_source=tldrnewsletter", "description": "This X post contains a screenshot of Claude 3's system prompt. According to the prompt, Claude's knowledge base was last updated in August 2023. It is instructed to give concise responses to simple questions but provide thorough responses to more complex and open-ended questions. The bot is told to answer questions without engaging in stereotyping. Claude will not mention information about itself unless the information is directly pertinent to the query.", "tag": [], "date": "2024-03-11"}
{"title": "High Agency (7 minute read)", "link": "https://suryad.com/blog/high-agency/?utm_source=tldrnewsletter", "description": "People are able to render anything in the world. They just have to be audacious enough and ambitious enough to envision a different reality. Couple this with the ability to inspire others, and you can become a force of nature. AGI makes raw skill less important, but it will still take hard work and unwavering commitment to make a profound impact in people's lives.", "tag": [], "date": "2024-03-11"}
{"title": "Hatchet (GitHub Repo)", "link": "https://github.com/hatchet-dev/hatchet?utm_source=tldrnewsletter", "description": "By replacing difficult-to-manage legacy queues and pub/subsystems, Hatchet allows developers to design durable workloads that recover from failure and solve for problems like concurrency, fairness, and rate limiting.", "tag": [], "date": "2024-03-11"}
{"title": "Apple backtracks, reinstates Epic Games’ iOS developer account in Europe (3 minute read)", "link": "https://arstechnica.com/gaming/2024/03/apple-backtracks-reinstates-epic-games-ios-developer-account-in-europe/?utm_source=tldrnewsletter", "description": "Epic has agreed to follow Apple's rules, including its DMA policies.", "tag": [], "date": "2024-03-11"}
{"title": "Rolldown (GitHub Repo)", "link": "https://github.com/rolldown-rs/rolldown?utm_source=tldrnewsletter", "description": "Rolldown is a fast bundler for JavaScript with a Rollup-compatible API and plugin interface.", "tag": [], "date": "2024-03-11"}
{"title": "Korean researchers power-shame Nvidia with new neural AI chip — claim 625 times less power draw, 41 times smaller (3 minute read)", "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/korean-researchers-power-shame-nvidia-with-new-neural-ai-chip-claim-625-times-less-power-41-times-smaller?utm_source=tldrnewsletter", "description": "It is the first ultra-low power AI accelerator chip capable of language language model processing.", "tag": [], "date": "2024-03-11"}
{"title": "React Geiger (GitHub Repo)", "link": "https://github.com/kristiandupont/react-geiger?utm_source=tldrnewsletter", "description": "React Geiger runs in the background and alerts developers to excessively slow React component rerenders.", "tag": [], "date": "2024-03-11"}
{"title": "I'm betting on Call-by-Push-Value (10 minute read)", "link": "https://thunderseethe.dev/posts/bet-on-cbpv/?utm_source=tldrnewsletter", "description": "Call-by-Push-Value supports both Call-by-Value and Call-by-Name/Need with one set of semantics by distinguishing between values and computations.", "tag": [], "date": "2024-03-11"}
