{"title": "TLDR is hiring a part time curator for our TLDR Crypto newsletter (Fully Remote, $100/hr)", "link": "mailto:jobs@tldr.tech", "description": "TLDR is hiring a part time curator to lead our TLDR Crypto newsletter curation team. The newsletter already has over 250,000 subscribers, it's a great way to build a personal brand within the crypto community.", "tag": [], "date": "2024-02-29"}
{"title": "Elon Musk’s bold claim: Tesla’s Roadster to hit 0-60 mph in less than one second (4 minute read)", "link": "https://interestingengineering.com/transportation/elon-musks-bold-claim-teslas-roadster-to-hit-0-60-mph-in-less-than-one-second?utm_source=tldrnewsletter", "description": "Elon Musk claims that the Tesla Roadster, which he plans to unveil by the end of 2024, can accelerate from 0 to 60 mph in less than a second. The current record holder for a production car's fastest 0-60 mph is the Dodge Challenger SRT Demon 170, which can do it in 1.66 seconds. If Musk's claims are true, the Tesla Roadster will be faster than the speed of sound. Tesla aims to ship the car in 2025, four years after its original 2020 target.", "tag": [], "date": "2024-02-29"}
{"title": "Adobe’s new prototype generative AI tool is the ‘Photoshop’ of music-making and editing (3 minute read)", "link": "https://www.theverge.com/2024/2/28/24085551/adobe-project-music-genai-control-prototype-tool-hot-pod?utm_source=tldrnewsletter", "description": "Adobe's Project Music GenAI Control is a prototype tool that allows users to generate and edit music using text prompts. It has controls for customizing results and remixing sections of audio. The tool can generate audio based on a reference melody and extend the length of audio clips. It is unclear whether the tool will allow uploads of any audio as reference material or how long clips can be extended for. The tool isn't available to the public yet and no release date has been announced.", "tag": [], "date": "2024-02-29"}
{"title": "Varda Capsule Reentry - Five Minutes from LEO to Earth (6 minute video)", "link": "https://www.youtube.com/watch?v=qw4DseiPu7E&amp;utm_source=tldrnewsletter", "description": "Varda Space Industries' W-1 spacecraft successfully landed in Utah on February 21. This was the first time a commercial company landed a spacecraft on US soil. The spacecraft reentered the Earth's atmosphere at speeds over Mach 25 before safely deploying its parachute and landing. Varda has released a video from a camera onboard the W-1 spacecraft showing it orbiting the Earth in low-Earth orbit, smoothly separating from Rocket Lab's satellite bus, and then reentering Earth's atmosphere.", "tag": [], "date": "2024-02-29"}
{"title": "Man in remission from blood cancer and HIV after remarkable treatment (4 minute read)", "link": "https://www.theguardian.com/us-news/2024/feb/28/blood-cancer-hiv-treatment?utm_source=tldrnewsletter", "description": "A Californian man who contracted blood cancer while living with HIV is in remission from both. The patient's treatment involved receiving a transplant of stem cells with a rare genetic mutation that provides resistance to HIV. The treatment targeted the blood cancer - HIV resistance was an extra benefit. The patient is the fifth person ever to overcome both illnesses.", "tag": [], "date": "2024-02-29"}
{"title": "Pingora (GitHub Repo)", "link": "https://github.com/cloudflare/pingora/tree/main?utm_source=tldrnewsletter", "description": "Pingora is a library for building fast, reliable, and programmable network services. It has been used to serve more than 40 million Internet requests per second at Cloudflare for more than a few years. Pingora features customizable load balancing and fail over strategies, support for a variety of observability tools, gRPC and websocket proxying, and TLS over OpenSSL or BoringSSL.", "tag": [], "date": "2024-02-29"}
{"title": "pipelined query language (GitHub Repo)", "link": "https://github.com/runreveal/pql?utm_source=tldrnewsletter", "description": "pql (pipelined query language) is a pipeline-based query language, inspired by Microsoft's Kusto Query Language, that compiles into SQL. The generated SQL is database agnostic. pql is designed to make developing queries simple by piping the result of each statement into the next. Examples are available.", "tag": [], "date": "2024-02-29"}
{"title": "Apple Spent More Than $10 Billion on Apple Car Before Canceling Project (2 minute read)", "link": "https://www.macrumors.com/2024/02/28/apple-car-10-billion-spent/?utm_source=tldrnewsletter", "description": "Apple spent more than $10 billion working on the Apple Car since the project first launched in 2014. The money was spent on research and development, with thousands of engineers and car experts working on the project. Apple was never able to find the right leader for the project - the project had four different leads over its course of 10 years. Most of the more than 2,000 employees who worked on the car project will be redistributed, while some will be laid off. Apple will apply its learnings from the car project to other devices.", "tag": [], "date": "2024-02-29"}
{"title": "Ask HN: Slow thinkers, how do you compensate for your lack of quick-wittedness? (GitHub Repo)", "link": "https://news.ycombinator.com/item?id=39522734&amp;utm_source=tldrnewsletter", "description": "This Hacker News thread contains tips for slow thinkers to overcome and compensate for their lack of quick thinking ability. Many slow thinkers have potential, but they lose their capacity when forced to make quick decisions or generate arguments on the spot. Ways to get around this include taking your time to answer questions and preparing for situations in advance. Finding and acknowledging weaknesses, and then finding specific techniques or processes to overcome them, will significantly improve most outcomes.", "tag": [], "date": "2024-02-29"}
{"title": "Bitcoin’s so high, it crashed Coinbase today (4 minute read)", "link": "https://techcrunch.com/2024/02/28/following-the-bitcoin-surge-coinbases-app-is-showing-users-a-zero-balance/?utm_source=tldrnewsletter", "description": "Bitcoin's recent surge to $60,000, close to its all-time high last seen in 2021, caused Coinbase's app to show some of its customers a zero balance across their accounts - customer funds are safe.", "tag": [], "date": "2024-02-29"}
{"title": "Why I use Firefox (8 minute read)", "link": "https://xn--ime-zza.eu/3?utm_source=tldrnewsletter", "description": "Firefox is very customizable, runs on its own browser engine, and has the best support for extensions on Android and a great picture-in-picture player, webpage translation is completely private, and Mozilla can't decrypt user data on its servers.", "tag": [], "date": "2024-02-29"}
{"title": "Stripe valuation surges to $65bn as IPO speculation grows (3 minute read)", "link": "https://www.siliconrepublic.com/start-ups/stripe-valuation-tender-offer-employees-stock-market-ipo?utm_source=tldrnewsletter", "description": "Stripe has signed agreements with investors to provide liquidity to its current and former employees for a tender offer.", "tag": [], "date": "2024-02-29"}
{"title": "Intel puts 1nm process (10A) on the roadmap for 2027 — also plans for fully AI-automated factories with 'Cobots' (7 minute read)", "link": "https://www.tomshardware.com/pc-components/cpus/intel-puts-1nm-process-10a-on-the-roadmap-for-2027-aiming-for-fully-ai-automated-factories-with-cobots?utm_source=tldrnewsletter", "description": "Intel's 10A process will begin development but not enter high-volume manufacturing in 2027.", "tag": [], "date": "2024-02-29"}
{"title": "Google CEO tells employees Gemini AI blunder ‘unacceptable’ (4 minute read)", "link": "https://www.cnbc.com/2024/02/28/google-ceo-tells-employees-gemini-ai-blunder-unacceptable.html?utm_source=tldrnewsletter", "description": "Google has taken Gemini's image-generation feature offline for further testing due to problematic issues related to bias.", "tag": [], "date": "2024-02-29"}
{"title": "Nvidia GEAR research group created to develop AI robots and NPCs for physical and virtual worlds (3 minute read)", "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/nvidia-gear-research-group-created-to-develop-ai-robots-and-npcs-for-for-physical-and-virtual-worlds?utm_source=tldrnewsletter", "description": "Nvidia's Generalist Embodied Agent Research (GEAR) group will further advance and build capable AI-based entities that can operate with skill in both the virtual and physical worlds.", "tag": [], "date": "2024-02-29"}
